const data = {
  classes: [
    /* -------------- [ 9 Class ] -------------- */
    {
      classID: 9,
      subject: 
      [
        {
          name: "Устный счет",
          complexity: {
            easy: [
              {
                question: "27 - 4 = ?",
                answer: "23",
                img: ""
              },
              {
                question: "54 + 2 = ?",
                answer: "56",
                img: ""
              },
              {
                question: "38 - 6 = ?",
                answer: "32",
                img: ""
              },
              {
                question: "71 + 7 = ?",
                answer: "78",
                img: ""
              },
              {
                question: "21 : 7 = ?",
                answer: "3",
                img: ""
              },
              {
                question: "12 : 6 = ?",
                answer: "2",
                img: ""
              },
              {
                question: "0 * 3 = ?",
                answer: "0",
                img: ""
              },
              {
                question: "9 : 1 = ?",
                answer: "9",
                img: ""
              },
              {
                question: "9 : 3 = ?",
                answer: "3",
                img: ""
              },
              {
                question: "630 : 9 = ?",
                answer: "70",
                img: ""
              },
              {
                question: "120 : 2 = ?",
                answer: "60",
                img: ""
              },
              {
                question: "15 * 8 = ?",
                answer: "120",
                img: ""
              },
              {
                question: "76 : 4 = ?",
                answer: "19",
                img: ""
              },
              {
                question: "65 + 3 = ?",
                answer: "68",
                img: ""
              },
              {
                question: "27 - 4 = ?",
                answer: "23",
                img: ""
              },
              {
                question: "34 + 2 = ?",
                answer: "36",
                img: ""
              },
              {
                question: "62 + 2 = ?",
                answer: "64",
                img: ""
              },
              {
                question: "37 - 1 = ?",
                answer: "36",
                img: ""
              },
              {
                question: "78 + 2 = ?",
                answer: "80",
                img: ""
              },
              {
                question: "87 - 2 = ?",
                answer: "85",
                img: ""
              },
              {
                question: "7 * 4 = ?",
                answer: "28",
                img: ""
              },
            ],
            medium: [
              {
                question: "0,2 * 3 = ?",
                answer: "0,6",
                img: ""
              },
              {
                question: "4/5 = ?",
                answer: "0,8",
                img: ""
              },
              {
                question: "10 - 1 * 10 = ?",
                answer: "0",
                img: ""
              },
              {
                question: "6 : 5 = ?",
                answer: "1,2",
                img: ""
              },
              {
                question: "0,02 * 10 = ?",
                answer: "0,2",
                img: ""
              },
              {
                question: "0,02 * 10 = ?",
                answer: "0,2",
                img: ""
              },
              {
                question: "2/5 = ?",
                answer: "0,4",
                img: ""
              },
              {
                question: "8 : 5 = ?",
                answer: "1,6",
                img: ""
              },
              {
                question: "0,8 * 8 = ?",
                answer: "6,4",
                img: ""
              },
              {
                question: "6,4 * 2 = ?",
                answer: "12,8",
                img: ""
              },
              {
                question: "1,6 * 16 = ?",
                answer: "25,6",
                img: ""
              },
            ],
            hard: [
              {
                question: "5х = 2",
                answer: "0,4",
                img: ""
              },
              {
                question: "5х = 7",
                answer: "1,4",
                img: ""
              },
              {
                question: "0,32 : 0,2 = ?",
                answer: "1,6",
                img: ""
              },
              {
                question: "0,36 * 5 = ?",
                answer: "1,8",
                img: ""
              },
              {
                question: "0,36 * 5 = ?",
                answer: "1,8",
                img: ""
              },
              {
                question: "1/1/2 = ?",
                answer: "2",
                img: ""
              },
              {
                question: "10x = 1",
                answer: "0,1",
                img: ""
              },
              {
                question: "1/8 - 2 : 80 = ?",
                answer: "0,8",
                img: ""
              },
              {
                question: "5x = 16",
                answer: "3,2",
                img: ""
              },
            ]
          }
        },
        {
          name: "Задания на логику",
          complexity: {
            easy: [
              {
                question: "Кирпич весит полкирпича и еще 2 килограмма. Сколько весит кирпич?",
                answer: "4",
                img: ""
              },
            ],
            medium: [
              {
                question: `На вопрос, кто из трех абитуриентов A, B, C может работать на компьютере, был получен ответ: если может работать B, то может работать и C, но не верно, что если может работать A, то может работать и C. Кто из трех абитуриентов может работать на персональном компьютере?\n1) A\n2) В\n3) С\n4) A и B\n5)A и C\n6) B и C\n7) Все`,
                answer: "6",
                img: ""
              },
            ],
            hard: [
              {
                question: `Кто из друзей (Иван, Петр, Алексей, Николай или Борис) коллекционирует марки, если известно, что:
                \n- если Борис коллекционирует марки, то их коллекционируют Иван и Николай;
                \n- если их коллекционирует Иван, то Петр тоже коллекционирует марки;
                \n- из двух друзей (Петра и Алексея) коллекционирует марки только один;
                \n- Алексей лишь в том случае коллекционирует марки, если их коллекционирует Николай;
                \n- по крайней мере, Николай или Борис коллекционирует марки.
                \n1)Петр и Борис
                \n2)Петр
                \n3)Алексей, Борис, Петр и Николай
                \n4)Петр, Николай, Иван и Борис
                \n5)Борис, Иван, Алексей и Петр
                \n6)Алексей и Иван
                \n7) Все`,
                answer: "6",
                img: ""
              },
            ],
          }
        },
        {
          name: "Геометрическое видение",
          complexity: {
            easy: [
              {
                question: `Биссектрисы углов N и M треугольника MNP пересекаются в точке A. Найдите угол NAM, если yгол N = 84, а угол М = 42.`,
                answer: "117",
                img: ""
              },
              {
                question: `Диагональ BD параллелограмма ABCD образует с его сторонами углы, равные 65° и 50°. Найдите меньший угол параллелограмма.`,
                answer: "65",
                img: ""
              },
              {
                question: `Сумма трех углов выпуклого четырехугольника равна 300°. Найдите четвертый угол.`,
                answer: "60",
                img: ""
              },
              {
                question: `Сторона квадрата равна 10. Найдите его площадь.`,
                answer: "100",
                img: ""
              },
              {
                question: `Найдите площадь параллелограмма, изображённого на рисунке.`,
                answer: "40",
                img: ""
              },
            ],
            medium: [
              {
                question: `В равностороннем треугольнике ABC биссектрисы CN и AM пересекаются в точке P. Найдите угол MPN.`,
                answer: "120",
                img: ""
              },
              {
                question: `В треугольнике ABC угол C прямой, BC = 8, sin A = 0,4. Найдите AB.`,
                answer: "20",
                img: ""
              },
              {
                question: `Найдите угол АDС равнобедренной трапеции ABCD, если диагональ АС образует с основанием ВС и боковой стороной АВ углы, равные 30° и 50° соответственно.`,
                answer: "80",
                img: ""
              },
              {
                question: `Сумма двух углов равнобедренной трапеции равна 140°. Найдите больший угол трапеции.`,
                answer: "110",
                img: ""
              },
              {
                question: `В прямоугольном треугольнике один из катетов равен 10, а угол, лежащий напротив него, равен 45°. Найдите площадь треугольника.`,
                answer: "50",
                img: ""
              },
            ],
            hard: [
              {
                question: `В равностороннем треугольнике ABC биссектрисы CN и AM пересекаются в точке P. Найдите угол MPN.`,
                answer: "120",
                img: ""
              },
            ]
          }
        },
        {
          name: "Текстовые задачи",
          complexity: {
            easy: [
              {
                question: `На изготовление 231 детали ученик тратит на 11 часов больше, чем мастер на изготовление 462 таких же деталей. Известно, что ученик за час делает на 4 детали меньше, чем мастер. Сколько деталей в час делает ученик?`,
                answer: "3",
                img: ""
              },
              {
                question: `Найдите целое число a, если из двух следующих утверждений верно только одно: 1) а>-17; 2)a>-18.`,
                answer: "-17",
                img: ""
              },
              {
                question: `Расстояние между городами А и В равно 750 км. Из города А в город В со скоростью 50 км/ч выехал первый автомобиль, а через три часа после этого навстречу ему из города В выехал со скоростью 70 км/ч второй автомобиль. На каком расстоянии от города А автомобили встретятся?`,
                answer: "400",
                img: ""
              },
              {
                question: `Моторная лодка прошла 36 км по течению реки и вернулась обратно, потратив на весь путь 5 часов. Скорость течения реки равна 3 км/ч. Найдите скорость лодки в неподвижной воде.`,
                answer: "15",
                img: ""
              },
              {
                question: `Пристани А и В расположены на реке, скорость течения которой на этом участке равна 3 км/ч. Лодка проходит туда и обратно без остановок со средней скоростью 8 км/ч. Найдите собственную скорость лодки.`,
                answer: "9",
                img: ""
              },
            ],
            medium: [
              {
                question: `Из пунктов А и В, расстояние между которыми 19 км, вышли одновременно навстречу друг другу два пешехода и встретились в 9 км от А. Найдите скорость пешехода, шедшего из А, если известно, что он шёл со скоростью, на 1 км/ч большей, чем пешеход, шедший из В, и сделал в пути получасовую остановку.`,
                answer: "6",
                img: ""
              },
              {
                question: `Расстояние между городами А и В равно 375 км. Город С находится между городами А и В. Из города А в город В выехал автомобиль, а через 1 час 30 минут следом за ним со скоростью 75 км/ч выехал мотоциклист, догнал автомобиль в городе С и повернул обратно. Когда он вернулся в А, автомобиль прибыл в В. Найдите расстояние от А до С.`,
                answer: "225",
                img: ""
              },
              {
                question: `Расстояние между пристанями А и В равно 80 км. Из А в В по течению реки отправился плот, а через 2 часа вслед за ним отправилась яхта, которая, прибыв в пункт В, тотчас повернула обратно и возвратилась в А. К этому времени плот прошел 22 км. Найдите скорость яхты в неподвижной воде, если скорость течения реки равна 2 км/ч.`,
                answer: "18",
                img: ""
              },
              {
                question: `Чтобы накачать в бак 117 л воды, требуется на 5 минут больше времени, чем на то, чтобы выкачать из него 96 л воды. За одну минуту можно выкачать на 3 л воды больше, чем накачать. Сколько литров воды накачивается в бак за минуту?`,
                answer: "9",
                img: ""
              },
              {
                question: `Железнодорожный состав длиной в 1 км прошёл бы мимо столба за 1 мин., а через туннель (от входа локомотива до выхода последнего вагона) при той же скорости — за 3 мин. Какова длина туннеля?`,
                answer: "2",
                img: ""
              },
            ],
            hard: [
              {
                question: `На пост главы администрации города претендовало три кандидата: Журавлёв, Зайцев, Иванов. Во время выборов за Иванова было отдано в 2 раза больше голосов, чем за Журавлёва, а за Зайцева — в 3 раза больше, чем за Журавлёва и Иванова вместе. Сколько процентов голосов было отдано за победителя?`,
                answer: "75",
                img: ""
              },
              {
                question: `Из пункта А в пункт В, расположенный ниже по течению реки, отправился плот. Одновременно навстречу ему из пункта В вышел катер. Встретив плот, катер сразу повернул и поплыл назад. Какую часть пути от А до В пройдет плот к моменту возвращения катера в пункт В, если скорость катера в стоячей воде вчетверо больше скорости течения реки?`,
                answer: "0,4",
                img: ""
              },
              {
                question: `Смешали некоторое количество 21-процентного раствора некоторого вещества с таким же количеством 95-процентного раствора этого же вещества. Сколько процентов составляет концентрация получившегося раствора?`,
                answer: "58",
                img: ""
              },
              {
                question: `Первый сплав содержит 5% меди, второй — 13% меди. Масса второго сплава больше массы первого на 4 кг. Из этих двух сплавов получили третий сплав, содержащий 10% меди. Найдите массу третьего сплава.`,
                answer: "16",
                img: ""
              },
              {
                question: `Имеются два сосуда, содержащие 10 кг и 16 кг раствора кислоты различной концентрации. Если их слить вместе, то получится раствор, содержащий 55% кислоты. Если же слить равные массы этих растворов, то полученный раствор будет содержать 61% кислоты. Сколько килограммов кислоты содержится в первом растворе?`,
                answer: "8,7",
                img: ""
              },
            ]
          }
        },
        {
          name: "Неравенства",
          complexity: {
            easy: [
              {
                question: ``,
                answer: "4",
                img: "img/class9/class9_room5_easy_1.jpg"
              },
              {
                question: ``,
                answer: "1",
                img: "img/class9/class9_room5_easy_2.jpg"
              },
              {
                question: ``,
                answer: "4",
                img: "img/class9/class9_room5_easy_3.jpg"
              },
              {
                question: ``,
                answer: "1",
                img: "img/class9/class9_room5_easy_4.jpg"
              },
              {
                question: ``,
                answer: "4",
                img: "img/class9/class9_room5_easy_5.jpg"
              },
            ],
            medium: [
              {
                question: ``,
                answer: "1",
                img: "img/class9/class9_room5_normal_1.jpg"
              },
              {
                question: ``,
                answer: "2",
                img: "img/class9/class9_room5_normal_2.jpg"
              },
              {
                question: ``,
                answer: "1",
                img: "img/class9/class9_room5_normal_3.jpg"
              },
              {
                question: ``,
                answer: "3",
                img: "img/class9/class9_room5_normal_4.jpg"
              },
              {
                question: ``,
                answer: "4",
                img: "img/class9/class9_room5_normal_5.jpg"
              },
            ],
            hard: [
              {
                question: ``,
                answer: "-3",
                img: "img/class9/class9_room5_hard_1.jpg"
              },
              {
                question: ``,
                answer: "-3",
                img: "img/class9/class9_room5_hard_2.jpg"
              },
              {
                question: ``,
                answer: "-3",
                img: "img/class9/class9_room5_hard_3.jpg"
              },
              {
                question: ``,
                answer: "2",
                img: "img/class9/class9_room5_hard_4.jpg"
              },
            ]
          }
        },
        {
          name: "Графики",
          complexity: {
            easy: [
              {
                question: ``,
                answer: "2",
                img: "img/class9/class9_room6_easy_1.jpg"
              },
              {
                question: ``,
                answer: "3",
                img: "img/class9/class9_room6_easy_2.jpg"
              },
              {
                question: ``,
                answer: "1",
                img: "img/class9/class9_room6_easy_3.jpg"
              },
              {
                question: ``,
                answer: "1",
                img: "img/class9/class9_room6_easy_4.jpg"
              },
              {
                question: ``,
                answer: "3",
                img: "img/class9/class9_room6_easy_3.jpg"
              },
            ],
            medium: [
              {
                question: ``,
                answer: "1",
                img: "img/class9/class9_room6_normal_1.jpg"
              },
              {
                question: ``,
                answer: "2",
                img: "img/class9/class9_room6_normal_2.jpg"
              },
              {
                question: ``,
                answer: "3",
                img: "img/class9/class9_room6_normal_3.jpg"
              },
              {
                question: ``,
                answer: "4",
                img: "img/class9/class9_room6_normal_4.jpg"
              },
            ],
            hard: [
              {
                question: ``,
                answer: "-1",
                img: "img/class9/class9_room6_hard_1.jpg"
              },
              {
                question: ``,
                answer: "2",
                img: "img/class9/class9_room6_hard_1.jpg"
              },
              {
                question: ``,
                answer: "3",
                img: "img/class9/class9_room6_hard_3.jpg"
              },
            ]
          }
        },
        {
          name: "Последовательности",
          complexity: {
            easy: [
              {
                question: `Выписаны первые несколько членов арифметической прогрессии: 3; 6; 9; 12;… Какое из следующих чисел есть среди членов этой прогрессии?
                83 - 95 - 100 - 102`,
                answer: "102",
                img: ""
              },
              {
                question: ``,
                answer: "11",
                img: "img/class9/class9_room7_easy_2.jpg"
              },
              {
                question: ``,
                answer: "7",
                img: "img/class9/class9_room7_easy_3.jpg"
              },
              {
                question: `Выписано несколько последовательных членов арифметической прогрессии: …; −9; x; −13; −15; … Найдите член прогрессии, обозначенный буквой x .`,
                answer: "-11",
                img: ""
              },
              {
                question: ``,
                answer: "28,7",
                img: "img/class9/class9_room7_easy_5.jpg"
              },
            ],
            medium: [
              {
                question: `Дана арифметическая прогрессия: -4; -2; 0; … Найдите сумму первых десяти её членов.`,
                answer: "50",
                img: ""
              },
              {
                question: `Дана арифметическая прогрессия: 33; 25; 17; … Найдите первый отрицательный член этой прогрессии.`,
                answer: "-7",
                img: ""
              },
              {
                question: `Какое наибольшее число последовательных натуральных чисел, начиная с 1, можно сложить, чтобы получившаяся сумма была меньше 528?`,
                answer: "31",
                img: ""
              },
              {
                question: `Какое наименьшее число последовательных натуральных чисел, начиная с 1, нужно сложить, чтобы получившаяся сумма была больше 465?`,
                answer: "31",
                img: ""
              },
              {
                question: `Записаны первые три члена арифметической прогрессии: 20; 17; 14. Какое число стоит в этой арифметической прогрессии на 91-м месте?`,
                answer: "-250",
                img: ""
              },
            ],
            hard: [
              {
                question: `Бригада маляров красит забор длиной 240 метров, ежедневно увеличивая норму покраски на одно и то же число метров. Известно, что за первый и последний день в сумме бригада покрасила 60 метров забора. Определите, сколько дней бригада маляров красила весь забор.`,
                answer: "-8",
                img: ""
              },
              {
                question: `Рабочие прокладывают тоннель длиной 500 метров, ежедневно увеличивая норму прокладки на одно и то же число метров. Известно, что за первый день рабочие проложили 3 метра тоннеля. Определите, сколько метров тоннеля проложили рабочие в последний день, если вся работа была выполнена за 10 дней.`,
                answer: "97",
                img: ""
              },
              {
                question: `Васе надо решить 434 задачи. Ежедневно он решает на одно и то же количество задач больше по сравнению с предыдущим днем. Известно, что за первый день Вася решил 5 задач. Определите, сколько задач решил Вася в последний день, если со всеми задачами он справился за 14 дней.`,
                answer: "57",
                img: ""
              },
              {
                question: `Турист идет из одного города в другой, каждый день проходя больше, чем в предыдущий день, на одно и то же расстояние. Известно, что за первый день турист прошел 10 километров. Определите, сколько километров прошел турист за третий день, если весь путь он прошел за 6 дней, а расстояние между городами составляет 120 километров.`,
                answer: "18",
                img: ""
              },
              {
                question: `Грузовик перевозит партию щебня массой 210 тонн, ежедневно увеличивая норму перевозки на одно и то же число тонн. Известно, что за первый день было перевезено 2 тонны щебня. Определите, сколько тонн щебня было перевезено за девятый день, если вся работа была выполнена за 14 дней.`,
                answer: "18",
                img: ""
              },
            ]
          }
        },
        {
          name: "Теория вероятности",
          complexity: {
            easy: [
              {
                question: `На экзамене 25 билетов, Сергей не выучил 3 из них. Найдите вероятность того, что ему попадётся выученный билет.`,
                answer: "0,88",
                img: ""
              },
              {
                question: `Телевизор у Маши сломался и показывает только один случайный канал. Маша включает телевизор. В это время по трем каналам из двадцати показывают кинокомедии. Найдите вероятность того, что Маша попадет на канал, где комедия не идет.`,
                answer: "0,85",
                img: ""
              },
              {
                question: `На тарелке 12 пирожков: 5 с мясом, 4 с капустой и 3 с вишней. Наташа наугад выбирает один пирожок. Найдите вероятность того, что он окажется с вишней.`,
                answer: "0,25",
                img: ""
              },
              {
                question: `Миша с папой решили покататься на колесе обозрения. Всего на колесе двадцать четыре кабинки, из них 5 — синие, 7 — зеленые, остальные — красные. Кабинки по очереди подходят к платформе для посадки. Найдите вероятность того, что Миша прокатится в красной кабинке.`,
                answer: "0,5",
                img: ""
              },
              {
                question: `Родительский комитет закупил 25 пазлов для подарков детям на окончание года, из них 15 с машинами и 10 с видами городов. Подарки распределяются случайным образом. Найдите вероятность того, что Толе достанется пазл с машиной.`,
                answer: "0,6",
                img: ""
              },
            ],
            medium: [
              {
                question: `Коля выбирает трехзначное число. Найдите вероятность того, что оно делится на 5.`,
                answer: "0,2",
                img: ""
              },
              {
                question: `В фирме такси в данный момент свободно 20 машин: 9 черных, 4 желтых и 7 зеленых. По вызову выехала одна из машин, случайно оказавшаяся ближе всего к заказчику. Найдите вероятность того, что к нему приедет желтое такси.`,
                answer: "0,2",
                img: ""
              },
              {
                question: `В каждой десятой банке кофе согласно условиям акции есть приз. Призы распределены по банкам случайно. Варя покупает банку кофе в надежде выиграть приз. Найдите вероятность того, что Варя не найдет приз в своей банке.`,
                answer: "0,9",
                img: ""
              },
              {
                question: `Для экзамена подготовили билеты с номерами от 1 до 50. Какова вероятность того, что наугад взятый учеником билет имеет однозначный номер?`,
                answer: "0,18",
                img: ""
              },
              {
                question: `В лыжных гонках участвуют 11 спортсменов из России, 6 спортсменов из Норвегии и 3 спортсмена из Швеции. Порядок, в котором спортсмены стартуют, определяется жребием. Найдите вероятность того, что первым будет стартовать спортсмен не из России.`,
                answer: "0,45",
                img: ""
              },
            ],
            hard: [
              {
                question: `Фирма «Вспышка» изготавливает фонарики. Вероятность того, что случайно выбранный фонарик из партии бракованный, равна 0,02. Какова вероятность того, что два случайно выбранных из одной партии фонарика окажутся небракованными?`,
                answer: "0,9604",
                img: ""
              },
              {
                question: `Стрелок 4 раза стреляет по мишеням. Вероятность попадания в мишень при одном выстреле равна 0,5. Найдите вероятность того, что стрелок первые 3 раза попал в мишени, а последний раз промахнулся.`,
                answer: "0,0625",
                img: ""
              },
              {
                question: `Игральную кость бросают дважды. Найдите вероятность того, что сумма двух выпавших чисел равна 4 или 7.`,
                answer: "0,25",
                img: ""
              },
              {
                question: `В мешке содержатся жетоны с номерами от 5 до 54 включительно. Какова вероятность, того, что извлеченный наугад из мешка жетон содержит двузначное число?`,
                answer: "0,9",
                img: ""
              },
              {
                question: `В магазине канцтоваров продаётся 100 ручек, из них 37 – красные, 8 – зелёные, 17 – фиолетовые, ещё есть синие и чёрные, их поровну. Найдите вероятность того, что Алиса наугад вытащит красную или чёрную ручку.`,
                answer: "0,56",
                img: ""
              },
            ]
          }
        }
      ]
    },
    {
      classID: 8,
      subject: 
      [
        {
          name: "Устный счет",
          complexity: {
            easy: [
              {
                question: "27 - 4 = ?",
                answer: "23",
                img: ""
              },
              {
                question: "54 + 2 = ?",
                answer: "56",
                img: ""
              },
              {
                question: "38 - 6 = ?",
                answer: "32",
                img: ""
              },
              {
                question: "71 + 7 = ?",
                answer: "78",
                img: ""
              },
              {
                question: "21 : 7 = ?",
                answer: "3",
                img: ""
              },
              {
                question: "12 : 6 = ?",
                answer: "2",
                img: ""
              },
              {
                question: "0 * 3 = ?",
                answer: "0",
                img: ""
              },
              {
                question: "9 : 1 = ?",
                answer: "9",
                img: ""
              },
              {
                question: "9 : 3 = ?",
                answer: "3",
                img: ""
              },
              {
                question: "630 : 9 = ?",
                answer: "70",
                img: ""
              },
              {
                question: "120 : 2 = ?",
                answer: "60",
                img: ""
              },
              {
                question: "15 * 8 = ?",
                answer: "120",
                img: ""
              },
              {
                question: "76 : 4 = ?",
                answer: "19",
                img: ""
              },
              {
                question: "65 + 3 = ?",
                answer: "68",
                img: ""
              },
              {
                question: "27 - 4 = ?",
                answer: "23",
                img: ""
              },
              {
                question: "34 + 2 = ?",
                answer: "36",
                img: ""
              },
              {
                question: "62 + 2 = ?",
                answer: "64",
                img: ""
              },
              {
                question: "37 - 1 = ?",
                answer: "36",
                img: ""
              },
              {
                question: "78 + 2 = ?",
                answer: "80",
                img: ""
              },
              {
                question: "87 - 2 = ?",
                answer: "85",
                img: ""
              },
              {
                question: "7 * 4 = ?",
                answer: "28",
                img: ""
              },
            ],
            medium: [
              {
                question: "0,2 * 3 = ?",
                answer: "0,6",
                img: ""
              },
              {
                question: "4/5 = ?",
                answer: "0,8",
                img: ""
              },
              {
                question: "10 - 1 * 10 = ?",
                answer: "0",
                img: ""
              },
              {
                question: "6 : 5 = ?",
                answer: "1,2",
                img: ""
              },
              {
                question: "0,02 * 10 = ?",
                answer: "0,2",
                img: ""
              },
              {
                question: "0,02 * 10 = ?",
                answer: "0,2",
                img: ""
              },
              {
                question: "2/5 = ?",
                answer: "0,4",
                img: ""
              },
              {
                question: "8 : 5 = ?",
                answer: "1,6",
                img: ""
              },
              {
                question: "0,8 * 8 = ?",
                answer: "6,4",
                img: ""
              },
              {
                question: "6,4 * 2 = ?",
                answer: "12,8",
                img: ""
              },
              {
                question: "1,6 * 16 = ?",
                answer: "25,6",
                img: ""
              },
            ],
            hard: [
              {
                question: "5х = 2",
                answer: "0,4",
                img: ""
              },
              {
                question: "5х = 7",
                answer: "1,4",
                img: ""
              },
              {
                question: "0,32 : 0,2 = ?",
                answer: "1,6",
                img: ""
              },
              {
                question: "0,36 * 5 = ?",
                answer: "1,8",
                img: ""
              },
              {
                question: "0,36 * 5 = ?",
                answer: "1,8",
                img: ""
              },
              {
                question: "1/1/2 = ?",
                answer: "2",
                img: ""
              },
              {
                question: "10x = 1",
                answer: "0,1",
                img: ""
              },
              {
                question: "1/8 - 2 : 80 = ?",
                answer: "0,8",
                img: ""
              },
              {
                question: "5x = 16",
                answer: "3,2",
                img: ""
              },
            ]
          }
        },
        {
          name: "Задания на логику",
          complexity: {
            easy: [
              {
                question: "Кирпич весит полкирпича и еще 2 килограмма. Сколько весит кирпич?",
                answer: "4",
                img: ""
              },
            ],
            medium: [
              {
                question: `На вопрос, кто из трех абитуриентов A, B, C может работать на компьютере, был получен ответ: если может работать B, то может работать и C, но не верно, что если может работать A, то может работать и C. Кто из трех абитуриентов может работать на персональном компьютере?\n1) A\n2) В\n3) С\n4) A и B\n5)A и C\n6) B и C\n7) Все`,
                answer: "6",
                img: ""
              },
            ],
            hard: [
              {
                question: `Кто из друзей (Иван, Петр, Алексей, Николай или Борис) коллекционирует марки, если известно, что:
                \n- если Борис коллекционирует марки, то их коллекционируют Иван и Николай;
                \n- если их коллекционирует Иван, то Петр тоже коллекционирует марки;
                \n- из двух друзей (Петра и Алексея) коллекционирует марки только один;
                \n- Алексей лишь в том случае коллекционирует марки, если их коллекционирует Николай;
                \n- по крайней мере, Николай или Борис коллекционирует марки.
                \n1)Петр и Борис
                \n2)Петр
                \n3)Алексей, Борис, Петр и Николай
                \n4)Петр, Николай, Иван и Борис
                \n5)Борис, Иван, Алексей и Петр
                \n6)Алексей и Иван
                \n7) Все`,
                answer: "6",
                img: ""
              },
            ],
          }
        },
        {
          name: "Геометрическое видение",
          complexity: {
            easy: [
              {
                question: `Катеты прямоугольного треугольника равны 6 и 8. Чему равна гипотенуза?`,
                answer: "10",
                img: ""
              },
              {
                question: `Вычислить tg45-sin30`,
                answer: "0,5",
                img: ""
              },
              {
                question: `Найдите меньший угол прямоугольного треугольника, если один острый угол на 60 градусов больше другого острого угла`,
                answer: "15",
                img: ""
              },
              {
                question: `Внешний угол при основании равнобедренного треугольника равен 140 градусов. Найдите угол, лежащий напротив основания`,
                answer: "100",
                img: ""
              },
              {
                question: `Найдите больший угол равнобедренного треугольника, если углы при основании в 2 раза меньше третьего`,
                answer: "90",
                img: ""
              },
            ],
            medium: [
              {
                question: `Боковая сторона равнобедренного треугольника равна 5, а высота, опущенная на основание – 4. Чему равен периметр треугольника?`,
                answer: "16",
                img: ""
              },
              {
                question: `Стороны прямоугольника равны 9 и 12. Найти диагонали прямоугольника.`,
                answer: "15",
                img: ""
              },
              {
                question: `В прямоугольном треугольнике ABC угол С – прямой. АС = 4, sinB=0,8. Чему равна гипотенуза?`,
                answer: "5",
                img: ""
              },
              {
                question: `Периметр параллелограмма равен 46. Чему равна его меньшая сторона?`,
                answer: "4",
                img: ""
              },
            ],
            hard: [
              {
                question: `Найти катеты равнобедренного прямоугольного треугольника, если гипотенуза равна корню из 2.`,
                answer: "1",
                img: ""
              },
              {
                question: `Диагонали трапеции равны 8 и 15, а основания 7 и 10. Чему равен угол между диагоналями?`,
                answer: "90",
                img: ""
              },
              {
                question: `В прямоугольном треугольнике ABC угол С – прямой. АС = 4, sinB=0,8. Найти BC?`,
                answer: "3",
                img: ""
              },
              {
                question: `В прямоугольнике одна сторона в 3 раза меньше другой, а площадь равна 48. Найти площадь квадрата, построенного на большей стороне.`,
                answer: "144",
                img: ""
              },
              {
                question: `Прямая АВ касается окружности с центром в точке О и радиусом, равным 9, в точке В. Найти АВ, если АО=41.`,
                answer: "40",
                img: ""
              },
            ]
          }
        },
        {
          name: "Текстовые задачи",
          complexity: {
            easy: [
              {
                question: `У двух мальчиков 300 почтовых марок. Если первый отдаст втором 30 марок то в них марок станет поровну. Сколько марок у первого мальчика?`,
                answer: "180",
                img: ""
              },
              {
                question: `Двое рабочих выполнили некоторую работу за 8 ч. Первый из них, работая отдельно, может выполнить ту же работу на 12ч быстрее второго, если тот будет работать отдельно. За сколько часов второй рабочий один может выполнить ту же работу?`,
                answer: "24",
                img: ""
              },
            ],
            medium: [
              {
                question: `Среднее геометрическое двух чисел равно 6. Найти большее число если меньше равно 3.`,
                answer: "9",
                img: ""
              },
              {
                question: `Сумма двух чисел, одно из которых меньше второго на 5 равна 55. Найти меньшее число.`,
                answer: "25",
                img: ""
              },
              {
                question: `В одном бидоне в 3 раза больше молока чем в другом. Если с первого бидона перелить 4 л молока в другой то в обоих бидонах молока станет поровну. Сколько молока в первом бидоне?`,
                answer: "12",
                img: ""
              },
              {
                question: `Расстояние между двумя населенными пунктами 50 км. Из этих пунктов одновременно навстречу друг другу выехали мотоциклист и велосипедист. Скорость мотоциклиста на 30 км/час больше. Встретились они на расстоянии 10 км от одного из населенных пунктов. Какова скорость велосипедиста?`,
                answer: "10",
                img: ""
              },
            ],
            hard: [
              {
                question: `Двое рабочих вместе изготовили 74 детали. Первый делал за день на 2 детали больше второго и работал 7 дней, а второй работал 8 дней. Сколько деталей в день изготавливал второй рабочий?`,
                answer: "4",
                img: ""
              },
              {
                question: `В урне находится 38 чёрных и белых шаров. Если число чёрных шаров уменьшить на 8 то шаров станет поровну. Сколько чёрных шаров в урне?`,
                answer: "23",
                img: ""
              },
              {
                question: `Фарфор состоит из глины, гипса и песка, массы которых пропорциональны числам 25, 1, 2. Сколько нужно песка чтобы изготовить 350 кг смеси?`,
                answer: "25",
                img: ""
              },
              {
                question: `На одной чаше весов лежит арбуз, а на второй - треть того же арбуза и гиря 2 кг. Весы находятся в равновесии. Какая масса арбуза?`,
                answer: "3",
                img: ""
              },
            ]
          }
        },
        {
          name: "Неравенства",
          complexity: {
            easy: [
              {
                question: `7x-3>11 \n 1) x > 2 2) x <  2 3) x > -2 4) x < -2`,
                answer: "1",
                img: ""
              },
              {
                question: `2y-4,8<4y+1,2 \n 1) x > 3 2) x <  3 3) x > -3 4) x < -3`,
                answer: "3",
                img: ""
              },
              {
                question: `4x+7<11 \n 1) x > 1 2) x <  1 3) x > -1 4) x < -1`,
                answer: "2",
                img: ""
              },
              {
                question: `3y+1,3>5y-0,1 \n 1) x > 0,7 2) x < 0,7 3) x > -0,7 4) x < -0,7`,
                answer: "2",
                img: ""
              },
            ],
            medium: [
              {
                question: `2(x+3)<3-x \n1) x > 3 2) x <  3 3) x > -3 4) x < -3`,
                answer: "4",
                img: ""
              },
              {
                question: `1,4x-3>2(0,5x-2,6) \n 1) x > 5,5 2) x <  5,5 3) x > -5,5 4) x < -5,5`,
                answer: "1",
                img: ""
              },
              {
                question: `3(x-2)>x-12 \n 1) x > 3 2) x <  3 3) x > -3 4) x < -3`,
                answer: "3",
                img: ""
              },
              {
                question: `1,8x+6<3(0,7x-0,1) \n 1) x > 21 2) x < 21 3) x > -21 4) x < -21`,
                answer: "1",
                img: ""
              },
            ],
            hard: [
              {
                question: `4(1-x)-3(x+2)<5 \n 1) x > 1 2) x <  1 3) x > -1 4) x < -1`,
                answer: "3",
                img: ""
              },
              {
                question: `(x-4)^2>(x+4)(x-4) \n 1) x > 4 2) x <  4 3) x > -4 4) x < -4`,
                answer: "2",
                img: ""
              },
              {
                question: `3(x+1)-2(2-x)>-11 \n 1) x > 2 2) x <  2 3) x > -2 4) x < -2`,
                answer: "3",
                img: ""
              },
              {
                question: ` (x+3)(x-3)<(x+3)^2 \n 1) x > 3 2) x < 3 3) x > -3 4) x < -3`,
                answer: "3",
                img: ""
              },
            ]
          }
        },
        {
          name: "Графики линейных функций",
          complexity: {
            easy: [
              {
                question: `Функция задана формулой y=2x-3. Найти значение y при x=4`,
                answer: "5",
                img: ""
              },
              {
                question: `Функция задана формулой y=2x-3. Найти значение x при котором y=1`,
                answer: "2",
                img: ""
              },
              {
                question: `Функция задана формулой y=2x-3. Принадлежит ли графику функции точка (-1;-5)? 1) Да 2) Нет`,
                answer: "1",
                img: ""
              },
              {
                question: `Функция задана формулой y=3x+2. Найти значение y при x=-1`,
                answer: "-1",
                img: ""
              },
              {
                question: `Функция задана формулой y=3x+2. Найти значение x при котором y=8`,
                answer: "2",
                img: ""
              },
              {
                question: `Функция задана формулой y=3x+2. Принадлежит ли графику функции точка (2;0)? 1) Да 2) Нет`,
                answer: "2",
                img: ""
              },
            ],
            medium: [
              {
                question: `Найти координаты точки пересечения графиков y=-8x-5 y=3. В ответе указать сумму координат`,
                answer: "2",
                img: ""
              },
              {
                question: `Найти координаты точки пересечения графиков y=-5x+1 y=-4.В ответе указать сумму координат`,
                answer: "-3",
                img: ""
              },
              {
                question: `Найти координаты точки пересечения графиков. y=10x-14 y=-3x+12. В ответе указать сумму координат`,
                answer: "8",
                img: ""
              },
              {
                question: `Найти координаты точки пересечения графиков. y=6-9x y=5x-8. В ответе указать сумму координат`,
                answer: "-2",
                img: ""
              },
              {
                question: `Найти координаты точки пересечения графиков. y=x/2 y=3x-5. В ответе указать сумму координат`,
                answer: "3",
                img: ""
              },
              {
                question: `Найти координаты точки пересечения графиков. y=-(x/3) y=12-x. В ответе указать сумму координат`,
                answer: "12",
                img: ""
              },
            ],
            hard: [
              {
                question: `Найти координаты точки пересечения графиков. 2x+3y=-1 8x-6y=14. В ответе указать сумму координат`,
                answer: "0",
                img: ""
              },
              {
                question: `Найти координаты точки пересечения графиков. 3x-2y=4 6x+4y=16. В ответе указать сумму координат`,
                answer: "3",
                img: ""
              },
              {
                question: `Найти координаты точки пересечения графиков. y=6+x/2 y=x+3. В ответе указать сумму координат`,
                answer: "3",
                img: ""
              },
              {
                question: `Найти координаты точки пересечения графиков. 5x-2y=0 x+2y=12. В ответе указать сумму координат`,
                answer: "7",
                img: ""
              },
            ]
          }
        },
        {
          name: "Сравнение корней",
          complexity: {
            easy: [
              {
                question: ``,
                answer: "1",
                img: "img/class8/class8_room7_easy_1.jpg"
              },
              {
                question: ``,
                answer: "3",
                img: "img/class8/class8_room7_easy_2.jpg"
              },
              {
                question: ``,
                answer: "1",
                img: "img/class8/class8_room7_easy_3.jpg"
              },
              {
                question: ``,
                answer: "1",
                img: "img/class8/class8_room7_easy_4.jpg"
              },
              {
                question: ``,
                answer: "4",
                img: "img/class8/class8_room7_easy_5.jpg"
              },
              {
                question: ``,
                answer: "4",
                img: "img/class8/class8_room7_easy_6.jpg"
              },
            ],
            medium: [
              {
                question: ``,
                answer: "2",
                img: "img/class8/class8_room7_normal_1.jpg"
              },
              {
                question: ``,
                answer: "3",
                img: "img/class8/class8_room7_normal_2.jpg"
              },
              {
                question: ``,
                answer: "2",
                img: "img/class8/class8_room7_normal_3.jpg"
              },
              {
                question: ``,
                answer: "2",
                img: "img/class8/class8_room7_normal_4.jpg"
              },
              {
                question: ``,
                answer: "3",
                img: "img/class8/class8_room7_normal_5.jpg"
              },
              {
                question: ``,
                answer: "3",
                img: "img/class8/class8_room7_normal_6.jpg"
              },
            ],
            hard: [
              {
                question: ``,
                answer: "2",
                img: "img/class8/class8_room7_hard_1.jpg"
              },
              {
                question: ``,
                answer: "4",
                img: "img/class8/class8_room7_hard_2.jpg"
              },
              {
                question: ``,
                answer: "3",
                img: "img/class8/class8_room7_hard_3.jpg"
              },
              {
                question: ``,
                answer: "3",
                img: "img/class8/class8_room7_hard_4.jpg"
              },
              {
                question: ``,
                answer: "3",
                img: "img/class8/class8_room7_hard_5.jpg"
              },
              {
                question: ``,
                answer: "3",
                img: "img/class8/class8_room7_hard_6.jpg"
              },
            ]
          }
        },
        {
          name: "Квадратные уравнения",
          complexity: {
            easy: [
              {
                question: ``,
                answer: "0",
                img: "img/class8/class8_room8_easy_1.jpg"
              },
              {
                question: ``,
                answer: "-2",
                img: "img/class8/class8_room8_easy_2.jpg"
              },
              {
                question: ``,
                answer: "0",
                img: "img/class8/class8_room8_easy_3.jpg"
              },
              {
                question: ``,
                answer: "3",
                img: "img/class8/class8_room8_easy_4.jpg"
              },
              {
                question: ``,
                answer: "0",
                img: "img/class8/class8_room8_easy_5.jpg"
              },
            ],
            medium: [
              {
                question: ``,
                answer: "5",
                img: "img/class8/class8_room8_normal_1.jpg"
              },
              {
                question: ``,
                answer: "-4",
                img: "img/class8/class8_room8_normal_2.jpg"
              },
              {
                question: ``,
                answer: "7",
                img: "img/class8/class8_room8_normal_3.jpg"
              },
              {
                question: ``,
                answer: "5",
                img: "img/class8/class8_room8_normal_4.jpg"
              },
              {
                question: ``,
                answer: "-1,25",
                img: "img/class8/class8_room8_normal_5.jpg"
              },
            ],
            hard: [
              {
                question: ``,
                answer: "-7",
                img: "img/class8/class8_room8_hard_1.jpg"
              },
              {
                question: ``,
                answer: "-1",
                img: "img/class8/class8_room8_hard_2.jpg"
              },
              {
                question: ``,
                answer: "10",
                img: "img/class8/class8_room8_hard_3.jpg"
              },
              {
                question: ``,
                answer: "5",
                img: "img/class8/class8_room8_hard_4.jpg"
              },
              {
                question: ``,
                answer: "-14",
                img: "img/class8/class8_room8_hard_5.jpg"
              },
            ]
          }
        }
      ]
    },
    {
      classID: 7,
      subject:
      [
        {
          name: "Устный счет",
          complexity: {
            easy: [
              {
                question: "27 - 4 = ?",
                answer: "23",
                img: ""
              },
              {
                question: "54 + 2 = ?",
                answer: "56",
                img: ""
              },
              {
                question: "38 - 6 = ?",
                answer: "32",
                img: ""
              },
              {
                question: "71 + 7 = ?",
                answer: "78",
                img: ""
              },
              {
                question: "21 : 7 = ?",
                answer: "3",
                img: ""
              },
              {
                question: "12 : 6 = ?",
                answer: "2",
                img: ""
              },
              {
                question: "0 * 3 = ?",
                answer: "0",
                img: ""
              },
              {
                question: "9 : 1 = ?",
                answer: "9",
                img: ""
              },
              {
                question: "9 : 3 = ?",
                answer: "3",
                img: ""
              },
              {
                question: "630 : 9 = ?",
                answer: "70",
                img: ""
              },
              {
                question: "120 : 2 = ?",
                answer: "60",
                img: ""
              },
              {
                question: "15 * 8 = ?",
                answer: "120",
                img: ""
              },
              {
                question: "76 : 4 = ?",
                answer: "19",
                img: ""
              },
              {
                question: "65 + 3 = ?",
                answer: "68",
                img: ""
              },
              {
                question: "27 - 4 = ?",
                answer: "23",
                img: ""
              },
              {
                question: "34 + 2 = ?",
                answer: "36",
                img: ""
              },
              {
                question: "62 + 2 = ?",
                answer: "64",
                img: ""
              },
              {
                question: "37 - 1 = ?",
                answer: "36",
                img: ""
              },
              {
                question: "78 + 2 = ?",
                answer: "80",
                img: ""
              },
              {
                question: "87 - 2 = ?",
                answer: "85",
                img: ""
              },
              {
                question: "7 * 4 = ?",
                answer: "28",
                img: ""
              },
            ],
            medium: [
              {
                question: "0,2 * 3 = ?",
                answer: "0,6",
                img: ""
              },
              {
                question: "4/5 = ?",
                answer: "0,8",
                img: ""
              },
              {
                question: "10 - 1 * 10 = ?",
                answer: "0",
                img: ""
              },
              {
                question: "6 : 5 = ?",
                answer: "1,2",
                img: ""
              },
              {
                question: "0,02 * 10 = ?",
                answer: "0,2",
                img: ""
              },
              {
                question: "0,02 * 10 = ?",
                answer: "0,2",
                img: ""
              },
              {
                question: "2/5 = ?",
                answer: "0,4",
                img: ""
              },
              {
                question: "8 : 5 = ?",
                answer: "1,6",
                img: ""
              },
              {
                question: "0,8 * 8 = ?",
                answer: "6,4",
                img: ""
              },
              {
                question: "6,4 * 2 = ?",
                answer: "12,8",
                img: ""
              },
              {
                question: "1,6 * 16 = ?",
                answer: "25,6",
                img: ""
              },
            ],
            hard: [
              {
                question: "5х = 2",
                answer: "0,4",
                img: ""
              },
              {
                question: "5х = 7",
                answer: "1,4",
                img: ""
              },
              {
                question: "0,32 : 0,2 = ?",
                answer: "1,6",
                img: ""
              },
              {
                question: "0,36 * 5 = ?",
                answer: "1,8",
                img: ""
              },
              {
                question: "0,36 * 5 = ?",
                answer: "1,8",
                img: ""
              },
              {
                question: "1/1/2 = ?",
                answer: "2",
                img: ""
              },
              {
                question: "10x = 1",
                answer: "0,1",
                img: ""
              },
              {
                question: "1/8 - 2 : 80 = ?",
                answer: "0,8",
                img: ""
              },
              {
                question: "5x = 16",
                answer: "3,2",
                img: ""
              },
            ]
          }
        },
        {
          name: "Задания на логику",
          complexity: {
            easy: [
              {
                question: "Кирпич весит полкирпича и еще 2 килограмма. Сколько весит кирпич?",
                answer: "4",
                img: ""
              },
            ],
            medium: [
              {
                question: `На вопрос, кто из трех абитуриентов A, B, C может работать на компьютере, был получен ответ: если может работать B, то может работать и C, но не верно, что если может работать A, то может работать и C. Кто из трех абитуриентов может работать на персональном компьютере?\n1) A\n2) В\n3) С\n4) A и B\n5)A и C\n6) B и C\n7) Все`,
                answer: "6",
                img: ""
              },
            ],
            hard: [
              {
                question: `Кто из друзей (Иван, Петр, Алексей, Николай или Борис) коллекционирует марки, если известно, что:
                \n- если Борис коллекционирует марки, то их коллекционируют Иван и Николай;
                \n- если их коллекционирует Иван, то Петр тоже коллекционирует марки;
                \n- из двух друзей (Петра и Алексея) коллекционирует марки только один;
                \n- Алексей лишь в том случае коллекционирует марки, если их коллекционирует Николай;
                \n- по крайней мере, Николай или Борис коллекционирует марки.
                \n1)Петр и Борис
                \n2)Петр
                \n3)Алексей, Борис, Петр и Николай
                \n4)Петр, Николай, Иван и Борис
                \n5)Борис, Иван, Алексей и Петр
                \n6)Алексей и Иван
                \n7) Все`,
                answer: "6",
                img: ""
              },
            ],
          }
        },
        {
          name: "Геометрическое видение",
          complexity: {
            easy: [
              {
                question: `В треугольнике ABC проведена биссектриса CE. Найдите величину угла BCE, если ∠BAC = 46° и ∠ABC = 78°.`,
                answer: "28",
                img: ""
              },
              {
                question: `В треугольнике два угла равны 36° и 73°. Найдите его третий угол.`,
                answer: "71",
                img: ""
              },
              {
                question: `В треугольнике два угла равны 43° и 88°. Найдите его третий угол. Ответ дайте в градусах.`,
                answer: "49",
                img: ""
              },
              {
                question: `На клетчатой бумаге с размером клетки 1 х 1 изображена фигура. Найдите её площадь.`,
                answer: "10",
                img: "img/class7/class7_room3_easy_4.jpg"
              },
              {
                question: `На клетчатой бумаге с размером клетки 1 х 1 изображена фигура. Найдите её площадь.`,
                answer: "18",
                img: "img/class7/class7_room3_easy_5.jpg"
              },
            ],
            medium: [
              {
                question: `На клетчатой бумаге с размером клетки 1 см × 1 см отмечены три точки: A, B и C. Найдите расстояние от точки A до прямой BC.`,
                answer: "2",
                img: "img/class7/class7_room3_normal_1.jpg"
              },
              {
                question: `На клетчатой бумаге с размером клетки 1 см x 1 см отмечены точки А, В и С. Найдите расстояние от точки А до середины отрезка ВС.`,
                answer: "4",
                img: "img/class7/class7_room3_normal_2.jpg"
              },
              {
                question: `На сторонах угла BAC, равного 20°, и на его биссектрисе отложены равные отрезки AB, AC и AD. Определите величину угла BDC.`,
                answer: "170",
                img: ""
              },
              {
                question: `В треугольнике ABC стороны AB и BС равны, угол B равен 76. Биссектрисы углов A и C пересекаются в точке M. Найдите величину угла AMC.`,
                answer: "128",
                img: ""
              },
              {
                question: `В треугольнике ABC стороны AB и BС равны, угол B равен 88. Биссектрисы углов A и C пересекаются в точке M. Найдите величину угла AMC.`,
                answer: "134",
                img: ""
              },
            ],
            hard: [
              {
                question: `В треугольнике ABC проведена биссектриса AL, угол ALC равен 121°, угол ABC равен 101°. Найдите угол ACB. Ответ дайте в градусах.`,
                answer: "39",
                img: ""
              },
              {
                question: `В треугольнике ABC проведена биссектриса AL, угол ALC равен 78°, угол ABC равен 52°. Найдите угол ACB.`,
                answer: "76",
                img: ""
              },
              {
                question: `В равнобедренном треугольнике АВС с основанием ВС проведена медиана АМ. Найдите медиану АМ, если периметр треугольника АВС равен 56 см, а периметр треугольника АВМ равен 42 см.`,
                answer: "14",
                img: ""
              },
              {
                question: `Высоты, проведенные к боковым сторонам АВ и АС остроугольного равнобедренного треугольника АВС, пересекаются в точке М. Найдите углы при основании, если угол ВМС = 140°.`,
                answer: "70",
                img: ""
              },
              {
                question: `Отрезки AB и CD — диаметры окружности с центром O. Найдите периметр треугольника AOD, если известно, что CB = 13 см, AB = 16 см.`,
                answer: "29",
                img: ""
              },
            ]
          }
        },
        {
          name: "Текстовые задачи",
          complexity: {
            easy: [
              {
                question: `Из двух городов, расстояние между которыми равно 560 км, навстречу друг другу одновременно выехали два автомобиля. Через сколько часов автомобили встретятся, если их скорости равны 65 км/ч и 75 км/ч?`,
                answer: "4",
                img: ""
              },
              {
                question: `Половину времени, затраченного на дорогу, автомобиль ехал со скоростью 84 км/ч, а вторую половину времени — со скоростью 56 км/ч. Найдите среднюю скорость автомобиля на протяжении всего пути. Ответ дайте в км/ч`,
                answer: "70",
                img: ""
              },
              {
                question: `Один мастер может выполнить заказ за 40 часов, а другой — за 24 часа. За сколько часов выполнят заказ оба мастера, работая вместе?`,
                answer: "15",
                img: ""
              },
              {
                question: `Две трубы наполняют бассейн за 8 часов, а одна первая труба наполняет бассейн за 12 часов. За сколько часов наполняет бассейн одна вторая труба?`,
                answer: "24",
                img: ""
              },
            ],
            medium: [
              {
                question: `Из городов A и B, расстояние между которыми равно 420 км, навстречу друг другу одновременно выехали два автомобиля и встретились через 4 часа на расстоянии 220 км от города B. Найдите скорость автомобиля, выехавшего из города A.`,
                answer: "50",
                img: ""
              },
              {
                question: `Поезд, двигаясь равномерно со скоростью 60 км/ч, проезжает мимо придорожного столба за 30 секунд. Найдите длину поезда в метрах.`,
                answer: "500",
                img: ""
              },
              {
                question: `Из двух пунктов реки, расстояние между которыми 57 км, навстречу друг другу движутся две моторные лодки, собственные скорости которых равны. Лодка, идущая по течению, до встречи шла 1 час, а лодка, идущая против течения, 2ч. Скорость течения реки 3 км/ч. Найти собственную скорость лодки.`,
                answer: "20",
                img: ""
              },
              {
                question: `По течению реки катер прошел за 7 ч столько же километров, сколько он проходит за 8 ч против течения. Собственная скорость катера 30 км/ч. Найдите скорость течения реки.`,
                answer: "2",
                img: ""
              },
              {
                question: `Первую треть трассы автомобиль ехал со скоростью 100 км/ч, вторую треть — со скоростью 75 км/ч, а последнюю — со скоростью 60 км/ч. Найдите среднюю скорость автомобиля на протяжении всего пути. Ответ дайте в км/ч.`,
                answer: "80",
                img: ""
              },
            ],
            hard: [
              {
                question: `Расстояние между городами A и B равно 435 км. Из города A в город B со скоростью 60 км/ч выехал первый автомобиль, а через час после этого навстречу ему из города B выехал со скоростью 65 км/ч второй автомобиль. На каком расстоянии от города A автомобили встретятся?`,
                answer: "240",
                img: ""
              },
              {
                question: `Два пешехода отправляются из одного и того же места в одном направлении на прогулку по аллее парка. Скорость первого на 1 км/ч больше скорости второго. Через сколько минут расстояние между пешеходами станет равным 200 метрам?`,
                answer: "12",
                img: ""
              },
              {
                question: `Поезд, двигаясь равномерно со скоростью 54 км/ч, проезжает мимо идущего параллельно путям со скоростью 6 км/ч навстречу ему пешехода за 30 секунд. Найдите длину поезда в метрах.`,
                answer: "400",
                img: ""
              },
              {
                question: `Поезд, двигаясь равномерно со скоростью 90 км/ч, проезжает мимо лесополосы, длина которой равна 800 метрам, за 1 минуту. Найдите длину поезда в метрах.`,
                answer: "700",
                img: ""
              },
              {
                question: `Первую треть трассы автомобиль ехал со скоростью 100 км/ч, вторую треть — со скоростью 75 км/ч, а последнюю — со скоростью 60 км/ч. Найдите среднюю скорость автомобиля на протяжении всего пути. Ответ дайте в км/ч.`,
                answer: "75",
                img: ""
              },
            ]
          }
        },
        {
          name: "Сравнение дробей",
          complexity: {
            easy: [
              {
                question: `Выбрать наибольшую дробь. 1) 8/3 2) 9/7 3) 10/5 4) 5/10`,
                answer: "1",
                img: ""
              },
              {
                question: `Выбрать наибольшую дробь. 1) 5/5 2) 6/9 3) 10/3 4) 2/8`,
                answer: "3",
                img: ""
              },
              {
                question: `Выбрать наибольшую дробь. 1) 6/5 2) 7/4 3) 3/8 4) 7/2`,
                answer: "4",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 10/9 2) 9/9 3) 4/2 4) 2/5`,
                answer: "4",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 2/2 2) 8/2 3) 5/9 4) 4/10`,
                answer: "4",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 4/9 2) 5/2 3) 1/9 4) 9/6`,
                answer: "2",
                img: ""
              },
            ],
            medium: [
              {
                question: `Выбрать наибольшую дробь. 1) 53/37 2) 30/7 3) 92/73 4) 99/23`,
                answer: "4",
                img: ""
              },
              {
                question: `Выбрать наибольшую дробь. 1) 38/83 2) 10/76 3) 72/28 4) 86/67`,
                answer: "3",
                img: ""
              },
              {
                question: `Выбрать наибольшую дробь. 1) 4/27 2) 90/46 3) 64/82 4) 90/28`,
                answer: "4",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 46/64 2) 3/28 3) 87/50 4) 12/66`,
                answer: "2",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 45/11 2) 18/61 3) 56/90 4) 25/62`,
                answer: "2",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 65/12 2) 97/27 3) 31/35 4) 35/97`,
                answer: "4",
                img: ""
              },
            ],
            hard: [
              {
                question: `Выбрать наибольшую дробь. 1) 32/820 2) 80/958 3) 321/535 4) 163/939`,
                answer: "3",
                img: ""
              },
              {
                question: `Выбрать наибольшую дробь. 1) 29/780 2) 284/535 3) 18/781 4) 76/655`,
                answer: "2",
                img: ""
              },
              {
                question: `Выбрать наибольшую дробь. 1) 759/854 2) 240/854 3) 240/645 4) 774/908`,
                answer: "1",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 128/743 2) 733/643 3) 111/747 4) 409/822`,
                answer: "3",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 334/664 2) 245/258 3) 431/977 4) 327/609`,
                answer: "3",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 406/682 2) 496/849 3) 839/942 4) 724/94`,
                answer: "3",
                img: ""
              },
            ]
          }
        },
        {
          name: "Графики линейных функций",
          complexity: {
            easy: [
              {
                question: `Функция задана формулой y=2x-3. Найти значение y при x=4`,
                answer: "5",
                img: ""
              },
              {
                question: `Функция задана формулой y=2x-3. Найти значение y при y=1`,
                answer: "2",
                img: ""
              },
              {
                question: `Функция задана формулой y=2x-3. Принадлежит ли графику функции точка (-1;-5)? 1) Да 2) Нет`,
                answer: "1",
                img: ""
              },
              {
                question: `Функция задана формулой y=3x+2. Найти значение y при x=-1`,
                answer: "-1",
                img: ""
              },
              {
                question: `Функция задана формулой y=3x+2. Найти значение y при y=8`,
                answer: "2",
                img: ""
              },
              {
                question: `Функция задана формулой y=3x+2. Принадлежит ли графику функции точка (2;0)? 1) Да 2) Нет`,
                answer: "2",
                img: ""
              },
            ],
            medium: [
              {
                question: `Найти координаты точки пересечения графиков y=-8x-5 y=3. В ответе указать сумму координат`,
                answer: "2",
                img: ""
              },
              {
                question: `Найти координаты точки пересечения графиков y=-5x+1 y=-4. В ответе указать сумму координат`,
                answer: "-3",
                img: ""
              },
              {
                question: `Найти координаты точки пересечения графиков y=10x-14 y=-3x+12. В ответе указать сумму координат`,
                answer: "8",
                img: ""
              },
              {
                question: `Найти координаты точки пересечения графиков y=6-9x y=5x-8. В ответе указать сумму координат`,
                answer: "-2",
                img: ""
              },
              {
                question: `Найти координаты точки пересечения графиков y=x/2 y=3x-5. В ответе указать сумму координат`,
                answer: "3",
                img: ""
              },
              {
                question: `Найти координаты точки пересечения графиков y=-(x/3) y=12-x. В ответе указать сумму координат`,
                answer: "12",
                img: ""
              },
            ],
            hard: [
              {
                question: `Найти координаты точки пересечения графиков 2x+3y=-1 8x-6y=14. В ответе указать сумму координат`,
                answer: "0",
                img: ""
              },
              {
                question: `Найти координаты точки пересечения графиков 3x-2y=4 6x+4y=16. В ответе указать сумму координат`,
                answer: "3",
                img: ""
              },
              {
                question: `Найти координаты точки пересечения графиков y=(6+x)/2 y=x+3. В ответе указать сумму координат`,
                answer: "3",
                img: ""
              },
              {
                question: `Найти координаты точки пересечения графиков 5x-2y=0 x+2y=12. В ответе указать сумму координат`,
                answer: "7",
                img: ""
              },
            ]
          }
        },
        {
          name: "Разложение на множетели",
          complexity: {
            easy: [
              {
                question: `Разложить на множители выражение 6-3x. 1) 3(2-x) 2) 3(2+x) 3) 6(1-x) 4) 6(1+x)`,
                answer: "1",
                img: ""
              },
              {
                question: ``,
                answer: "4",
                img: "img/class7/class7_room7_easy_2.jpg"
              },
              {
                question: ``,
                answer: "3",
                img: "img/class7/class7_room7_easy_3.jpg"
              },
              {
                question: ``,
                answer: "1",
                img: "img/class7/class7_room7_easy_4.jpg"
              },
              {
                question: ``,
                answer: "2",
                img: "img/class7/class7_room7_easy_5.jpg"
              },
            ],
            medium: [
              {
                question: `Разложить на множители выражение ab-c-4(b-c) 1) (a-4)(b-c) 2) (a+4)(c-b) 3) (a-4)(b+c) 4) (a-4)(c-b)`,
                answer: "1",
                img: ""
              },
              {
                question: `Вычислить 419*(519-419) 1) 41900 2) 4190 3) 5190 4) 51900`,
                answer: "1",
                img: ""
              },
              {
                question: ``,
                answer: "1",
                img: "img/class7/class7_room7_normal_3.jpg"
              },
              {
                question: ``,
                answer: "1",
                img: "img/class7/class7_room7_normal_4.jpg"
              },
              {
                question: ``,
                answer: "1",
                img: "img/class7/class7_room7_normal_5.jpg"
              },
            ],
            hard: [
              {
                question: `Разложить на множители выражение a2+b+b+2 1) (b+2)(a+1) 2) (2+b)(a-1) 3) a(b+2) 4) (2+b)(1-a)`,
                answer: "1",
                img: ""
              },
              {
                question: `Разложить на множители выражение ab-c-(c-b) 1) (a-1)(b-c) 2) (a+1)(b-c) 3) (a-1)(c-b) 4) (a+1)(c-b)`,
                answer: "2",
                img: ""
              },
              {
                question: `Разложить на множители выражение 5x-5y-ax+ay 1) (x-y)(a-5) 2) (x-y)(a+5) 3) (x-y)(5-a) 4) (y-x)(5+a)`,
                answer: "3",
                img: ""
              },
              {
                question: ``,
                answer: "2",
                img: "img/class7/class7_room7_hard_4.jpg"
              },
              {
                question: ``,
                answer: "2",
                img: "img/class7/class7_room7_hard_5.jpg"
              },
            ]
          }
        },
        {
          name: "Системы линейных уровнений",
          complexity: {
            easy: [
              {
                question: ``,
                answer: "7",
                img: "img/class7/class7_room8_easy_1.jpg"
              },
              {
                question: ``,
                answer: "4",
                img: "img/class7/class7_room8_easy_2.jpg"
              },
              {
                question: ``,
                answer: "4",
                img: "img/class7/class7_room8_easy_3.jpg"
              },
              {
                question: ``,
                answer: "10",
                img: "img/class7/class7_room8_easy_4.jpg"
              },
              {
                question: ``,
                answer: "4",
                img: "img/class7/class7_room8_easy_5.jpg"
              },
            ],
            medium: [
              {
                question: ``,
                answer: "3",
                img: "img/class7/class7_room8_normal_1.jpg"
              },
              {
                question: ``,
                answer: "6",
                img: "img/class7/class7_room8_normal_2.jpg"
              },
              {
                question: ``,
                answer: "3",
                img: "img/class7/class7_room8_normal_3.jpg"
              },
              {
                question: ``,
                answer: "5",
                img: "img/class7/class7_room8_normal_4.jpg"
              },
              {
                question: ``,
                answer: "7",
                img: "img/class7/class7_room8_normal_5.jpg"
              },
            ],
            hard: [
              {
                question: ``,
                answer: "3,5",
                img: "img/class7/class7_room8_hard_1.jpg"
              },
              {
                question: ``,
                answer: "5",
                img: "img/class7/class7_room8_hard_2.jpg"
              },
              {
                question: ``,
                answer: "3",
                img: "img/class7/class7_room8_hard_3.jpg"
              },
              {
                question: ``,
                answer: "-1",
                img: "img/class7/class7_room8_hard_4.jpg"
              },
              {
                question: ``,
                answer: "5",
                img: "img/class7/class7_room8_hard_5.jpg"
              },
            ]
          }
        }
      ]
    },
    {
      classID: 6,
      subject:
      [
        {
          name: "Устный счет",
          complexity: {
            easy: [
              {
                question: "27 - 4 = ?",
                answer: "23",
                img: ""
              },
              {
                question: "54 + 2 = ?",
                answer: "56",
                img: ""
              },
              {
                question: "38 - 6 = ?",
                answer: "32",
                img: ""
              },
              {
                question: "71 + 7 = ?",
                answer: "78",
                img: ""
              },
              {
                question: "21 : 7 = ?",
                answer: "3",
                img: ""
              },
              {
                question: "12 : 6 = ?",
                answer: "2",
                img: ""
              },
              {
                question: "0 * 3 = ?",
                answer: "0",
                img: ""
              },
              {
                question: "9 : 1 = ?",
                answer: "9",
                img: ""
              },
              {
                question: "9 : 3 = ?",
                answer: "3",
                img: ""
              },
              {
                question: "630 : 9 = ?",
                answer: "70",
                img: ""
              },
              {
                question: "120 : 2 = ?",
                answer: "60",
                img: ""
              },
              {
                question: "15 * 8 = ?",
                answer: "120",
                img: ""
              },
              {
                question: "76 : 4 = ?",
                answer: "19",
                img: ""
              },
              {
                question: "65 + 3 = ?",
                answer: "68",
                img: ""
              },
              {
                question: "27 - 4 = ?",
                answer: "23",
                img: ""
              },
              {
                question: "34 + 2 = ?",
                answer: "36",
                img: ""
              },
              {
                question: "62 + 2 = ?",
                answer: "64",
                img: ""
              },
              {
                question: "37 - 1 = ?",
                answer: "36",
                img: ""
              },
              {
                question: "78 + 2 = ?",
                answer: "80",
                img: ""
              },
              {
                question: "87 - 2 = ?",
                answer: "85",
                img: ""
              },
              {
                question: "7 * 4 = ?",
                answer: "28",
                img: ""
              },
            ],
            medium: [
              {
                question: "0,2 * 3 = ?",
                answer: "0,6",
                img: ""
              },
              {
                question: "4/5 = ?",
                answer: "0,8",
                img: ""
              },
              {
                question: "10 - 1 * 10 = ?",
                answer: "0",
                img: ""
              },
              {
                question: "6 : 5 = ?",
                answer: "1,2",
                img: ""
              },
              {
                question: "0,02 * 10 = ?",
                answer: "0,2",
                img: ""
              },
              {
                question: "0,02 * 10 = ?",
                answer: "0,2",
                img: ""
              },
              {
                question: "2/5 = ?",
                answer: "0,4",
                img: ""
              },
              {
                question: "8 : 5 = ?",
                answer: "1,6",
                img: ""
              },
              {
                question: "0,8 * 8 = ?",
                answer: "6,4",
                img: ""
              },
              {
                question: "6,4 * 2 = ?",
                answer: "12,8",
                img: ""
              },
              {
                question: "1,6 * 16 = ?",
                answer: "25,6",
                img: ""
              },
            ],
            hard: [
              {
                question: "5х = 2",
                answer: "0,4",
                img: ""
              },
              {
                question: "5х = 7",
                answer: "1,4",
                img: ""
              },
              {
                question: "0,32 : 0,2 = ?",
                answer: "1,6",
                img: ""
              },
              {
                question: "0,36 * 5 = ?",
                answer: "1,8",
                img: ""
              },
              {
                question: "0,36 * 5 = ?",
                answer: "1,8",
                img: ""
              },
              {
                question: "1/1/2 = ?",
                answer: "2",
                img: ""
              },
              {
                question: "10x = 1",
                answer: "0,1",
                img: ""
              },
              {
                question: "1/8 - 2 : 80 = ?",
                answer: "0,8",
                img: ""
              },
              {
                question: "5x = 16",
                answer: "3,2",
                img: ""
              },
            ]
          }
        },
        {
          name: "Задания на логику",
          complexity: {
            easy: [
              {
                question: "Кирпич весит полкирпича и еще 2 килограмма. Сколько весит кирпич?",
                answer: "4",
                img: ""
              },
            ],
            medium: [
              {
                question: `На вопрос, кто из трех абитуриентов A, B, C может работать на компьютере, был получен ответ: если может работать B, то может работать и C, но не верно, что если может работать A, то может работать и C. Кто из трех абитуриентов может работать на персональном компьютере?\n1) A\n2) В\n3) С\n4) A и B\n5)A и C\n6) B и C\n7) Все`,
                answer: "6",
                img: ""
              },
            ],
            hard: [
              {
                question: `Кто из друзей (Иван, Петр, Алексей, Николай или Борис) коллекционирует марки, если известно, что:
                \n- если Борис коллекционирует марки, то их коллекционируют Иван и Николай;
                \n- если их коллекционирует Иван, то Петр тоже коллекционирует марки;
                \n- из двух друзей (Петра и Алексея) коллекционирует марки только один;
                \n- Алексей лишь в том случае коллекционирует марки, если их коллекционирует Николай;
                \n- по крайней мере, Николай или Борис коллекционирует марки.
                \n1)Петр и Борис
                \n2)Петр
                \n3)Алексей, Борис, Петр и Николай
                \n4)Петр, Николай, Иван и Борис
                \n5)Борис, Иван, Алексей и Петр
                \n6)Алексей и Иван
                \n7) Все`,
                answer: "6",
                img: ""
              },
            ],
          }
        },
        {
          name: "Геометрическое видение",
          complexity: {
            easy: [
              {
                question: ``,
                answer: "22",
                img: "img/class6/class6_room3_easy_1.jpg"
              },
              {
                question: ``,
                answer: "200",
                img: "img/class6/class6_room3_easy_2.jpg"
              },
              {
                question: ``,
                answer: "8",
                img: "img/class6/class6_room3_easy_3.jpg"
              },
              {
                question: ``,
                answer: "5",
                img: "img/class6/class6_room3_easy_4.jpg"
              },
            ],
            medium: [
              {
                question: `Сумма очков на противоположных гранях обычного игрального кубика равна 7. Например, если на грани 1 очко, то на противоположной грани 6 очков, если на грани 2 очка, то на противоположной 5 очков. На рисунке 1 изображён игральный кубик. На рисунке 2 изображён этот же кубик. Какое число очков должно быть в пустой грани?`,
                answer: "4",
                img: "img/class6/class6_room3_normal_1.jpg"
              },
              {
                question: `Сумма очков на противоположных гранях обычного игрального кубика равна 7. Например, если на грани 1 очко, то на противоположной грани 6 очков, если на грани 2 очка, то на противоположной 5 очков. На рисунке 1 изображён игральный кубик. На рисунке 2 изображён этот же кубик. Какое число очков должно быть в пустой грани?`,
                answer: "6",
                img: "img/class6/class6_room3_normal_2.jpg"
              },
              {
                question: `Сумма очков на противоположных гранях обычного игрального кубика равна 7. Например, если на грани 1 очко, то на противоположной грани 6 очков, если на грани 2 очка, то на противоположной 5 очков. На рисунке 1 изображён игральный кубик. На рисунке 2 изображён этот же кубик. Какое число очков должно быть в пустой грани?`,
                answer: "6",
                img: "img/class6/class6_room3_normal_3.jpg"
              },
            ],
            hard: [
              {
                question: `Игральный кубик прокатили по столу. На рисунке изображён след кубика. В какой квадрат попадет грань с 4 точками? Считайте, что сумма чисел на противоположных сторонах кубика равна 7.`,
                answer: "4",
                img: "img/class6/class6_room3_hard_1.jpg"
              },
              {
                question: ``,
                answer: "5250",
                img: "img/class6/class6_room3_hard_2.jpg"
              },
              {
                question: `Игральный кубик прокатили по столу. На рисунке изображён след кубика. В какой квадрат попадет грань с 6 точками? Считайте, что сумма чисел на противоположных сторонах кубика равна 7.`,
                answer: "5",
                img: "img/class6/class6_room3_hard_3.jpg"
              },
              {
                question: `Игральный кубик прокатили по столу. На рисунке изображён след кубика. В какой квадрат попадет грань с 2 точками? Считайте, что сумма чисел на противоположных сторонах кубика равна 7.`,
                answer: "3",
                img: "img/class6/class6_room3_hard_4.jpg"
              },
            ]
          }
        },
        {
          name: "Текстовые задачи",
          complexity: {
            easy: [
              {
                question: `Отец и сын, работая вместе, покрасили забор за 12 ч. Если бы отец красил забор один, он выполнил бы эту работу за 21 ч. За сколько часов покрасил бы этот забор сын?`,
                answer: "28",
                img: ""
              },
              {
                question: `Редактор прочитал две пятых рукописи, что составило 80 страниц. На другой день он прочитал четверть оставшихся страниц. Сколько страниц в рукописи?`,
                answer: "200",
                img: ""
              },
              {
                question: `В одной пачке было в 2,5 раза больше тетрадей, чем в другой. Когда из второй пачки переложили в первую 5 тетрадей, то во второй пачке стало в 3 раза меньше тетрадей, чем впервой. Сколько тетрадей было в каждой пачке первоначально? В ответ указать сумму.`,
                answer: "140",
                img: ""
              },
              {
                question: `Даша купила 3 набора открыток. В первом наборе в 5 раз больше открыток, чем во втором, а в третьем на 8 открыток меньше, чем в первом. Если к первому набору добавить ещё 24 открытки, то количество открыток в нем будет равно количеству открыток во втором и третьем наборах вместе. Сколько открыток было в каждом из купленных наборов? В ответ указать сумму.`,
                answer: "344",
                img: ""
              },
              {
                question: `В одном элеваторе было зерна в 3 раза больше, чем в другом. Из первого элеватора вывезли 960 т зерна, а во второй привезли 240 т, после чего обоих элеваторах зерна стало поровну. Сколько тонн зерна было в каждом элеваторе первоначально? В ответ указать сумму.`,
                answer: "2400",
                img: ""
              },
            ],
            medium: [
              {
                question: `Из пункта М в пункт N выехал почтальон со скоростью 23 км/ч, и одновременно с ним из N в M выехал второй почтальон со скоростью 19 км/ч. Когда первый почтальон прибыл N, второму еще оставалось до М проехать 24 км. Каково расстояние между М и N?`,
                answer: "138",
                img: ""
              },
              {
                question: `Редактор прочитал две пятых рукописи, что составило 80 страниц. На другой день он прочитал четверть оставшихся страниц. Сколько страниц не прочитано?`,
                answer: "90",
                img: ""
              },
              {
                question: `У Шынар в копилке 80 монет достоинством 20 и 50 тенге Всего 2590 тенге. Сколько монет в копилке у Шынар достоинством 20 тенге? `,
                answer: "47",
                img: ""
              },
              {
                question: `Расстояние между двумя городами автобус преодолевает за 5,75 ч, а автомобиль, скорость которого на 10,5 км/ч больше, – за 5 ч. Определите скорость автомобиля.`,
                answer: "80,5",
                img: ""
              },
              {
                question: `Масса 3 корзин с грушами на 15 кг больше, а масса 2 корзин с бананами на 1 кг меньше массы одной корзины с яблоками. Найдите массу корзины с яблоками, если известно, что одна корзина с грушами тяжелее одной корзины с бананами на 4 кг.`,
                answer: "9",
                img: ""
              },
            ],
            hard: [
              {
                question: `Мотоциклист в первый час проехал 3/8 всего пути ,во второй час 3/5 остатка, а в третий час остальные 40 км. Найдите весь путь.`,
                answer: "160",
                img: ""
              },
              {
                question: `поезд проходит расстояние АВ за 10,5 ч. На сколько процентов следует увеличить его скорость, чтобы то же расстояние он преодолел за 8 ч?`,
                answer: "31,25",
                img: ""
              },
              {
                question: `У Шынар в копилке 80 монет достоинством 20 и 50 тенге Всего 2590 тенге. Сколько монет в копилке у Шынар достоинством 50 тенге? `,
                answer: "33",
                img: ""
              },
              {
                question: `В первый день садовод вскопал на 40% своего участка, а во второй — 40% оставшейся части. На третий день он закончил работу, вскопав 180 кв.м. Определить площадь всего участка?`,
                answer: "500",
                img: ""
              },
              {
                question: `Расстояние между двумя городами автобус преодолевает за 5,75 ч, а автомобиль, скорость которого на 10,5 км/ч больше, – за 5 ч. Определите расстояние между городами.`,
                answer: "402,5",
                img: ""
              },
            ]
          }
        },
        {
          name: "Дроби",
          complexity: {
            easy: [
              {
                question: `Число уменьшили в три раза, и получилось 42. Найдите исходное число.`,
                answer: "126",
                img: ""
              },
              {
                question: `Вычислить, в качестве ответа указать сумму числителя и знаменателя получившейся дроби 11/18 - 4/9 * 3/16`,
                answer: "55",
                img: ""
              },
              {
                question: `Вычислить, в качестве ответа указать сумму числителя и знаменателя получившейся дроби 72/73 * 34/65 + 72/73 * 39/65`,
                answer: "137",
                img: ""
              },
              {
                question: `Число 36 является 1/5 искомого числа. Найдите это число.`,
                answer: "115",
                img: ""
              },
              {
                question: `Число уменьшили на треть, и получилось 210. Найдите исходное число.`,
                answer: "315",
                img: ""
              },
            ],
            medium: [
              {
                question: `Вычислить, в качестве ответа указать сумму числителя и знаменателя получившейся дроби (6/5 - 3/4) * 2/3`,
                answer: "13",
                img: ""
              },
              {
                question: `Вычислить, в качестве ответа указать сумму числителя и знаменателя получившейся дроби (6/5 - 2/3) * 1/2`,
                answer: "19",
                img: ""
              },
              {
                question: `1,54-0,5*1,3`,
                answer: "0,89",
                img: ""
              },
              {
                question: `2,34-0,3*2,1`,
                answer: "1,22",
                img: ""
              },
              {
                question: `15 * (1 + 1/3 - 1/5)`,
                answer: "17",
                img: ""
              },
            ],
            hard: [
              {
                question: `Вычислить, в качестве ответа указать сумму числителя и знаменателя получившейся дроби 8/5 * (3/4 + 11/8)`,
                answer: "22",
                img: ""
              },
              {
                question: `Вычислить, в качестве ответа указать сумму числителя и знаменателя получившейся дроби -27/20 * (-(5/18)) - (-(21/56)) * (-(1/3))`,
                answer: "25",
                img: ""
              },
              {
                question: `Число увеличили на треть, и получилось 164. Найдите исходное число.`,
                answer: "123",
                img: ""
              },
              {
                question: `Число увеличили на треть от самого числа, и получилось 228. Найдите исходное число.`,
                answer: "171",
                img: ""
              },
              {
                question: `Число увеличили на 36, и оно составило 4/3 от исходного числа. Найдите исходное число.
                `,
                answer: "108",
                img: ""
              },
            ]
          }
        },
        {
          name: "Сравнение дробей",
          complexity: {
            easy: [
              {
                question: `Выбрать наибольшую дробь. 1) 8/3 2) 9/7 3) 10/5 4) 5/10`,
                answer: "1",
                img: ""
              },
              {
                question: `Выбрать наибольшую дробь. 1) 5/5 2) 6/9 3) 10/3 4) 2/8`,
                answer: "3",
                img: ""
              },
              {
                question: `Выбрать наибольшую дробь. 1) 6/5 2) 7/4 3) 3/8 4) 7/2`,
                answer: "4",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 10/9 2) 9/9 3) 4/2 4) 2/5`,
                answer: "4",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 2/2 2) 8/2 3) 5/9 4) 4/10`,
                answer: "4",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 4/9 2) 5/2 3) 1/9 4) 9/6`,
                answer: "2",
                img: ""
              },
            ],
            medium: [
              {
                question: `Выбрать наибольшую дробь. 1) 53/37 2) 30/7 3) 92/73 4) 99/23`,
                answer: "4",
                img: ""
              },
              {
                question: `Выбрать наибольшую дробь. 1) 38/83 2) 10/76 3) 72/28 4) 86/67`,
                answer: "3",
                img: ""
              },
              {
                question: `Выбрать наибольшую дробь. 1) 4/27 2) 90/46 3) 64/82 4) 90/28`,
                answer: "4",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 46/64 2) 3/28 3) 87/50 4) 12/66`,
                answer: "2",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 45/11 2) 18/61 3) 56/90 4) 25/62`,
                answer: "2",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 65/12 2) 97/27 3) 31/35 4) 35/97`,
                answer: "4",
                img: ""
              },
            ],
            hard: [
              {
                question: `Выбрать наибольшую дробь. 1) 32/820 2) 80/958 3) 321/535 4) 163/939`,
                answer: "3",
                img: ""
              },
              {
                question: `Выбрать наибольшую дробь. 1) 29/780 2) 284/535 3) 18/781 4) 76/655`,
                answer: "2",
                img: ""
              },
              {
                question: `Выбрать наибольшую дробь. 1) 759/854 2) 240/854 3) 240/645 4) 774/908`,
                answer: "1",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 128/743 2) 733/643 3) 111/747 4) 409/822`,
                answer: "3",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 334/664 2) 245/258 3) 431/977 4) 327/609`,
                answer: "3",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 406/682 2) 496/849 3) 839/942 4) 724/94`,
                answer: "3",
                img: ""
              },
            ]
          }
        },
        {
          name: "Отрицательные числа",
          complexity: {
            easy: [
              {
                question: `Вычислить -1,3+0,8`,
                answer: "-0,5",
                img: ""
              },
              {
                question: `Вычислить -2,5-6,7`,
                answer: "-9,2",
                img: ""
              },
              {
                question: `Вычислить 3,1-4,9`,
                answer: "-1,8",
                img: ""
              },
              {
                question: `Вычислить -2,4+8,7`,
                answer: "6,3",
                img: ""
              },
              {
                question: `Вычислить -2,5*(-4)`,
                answer: "10",
                img: ""
              },
            ],
            medium: [
              {
                question: `Вычислить 2,88: (-2,4)`,
                answer: "-1,2",
                img: ""
              },
              {
                question: `Вычислить -1,8*(-5)`,
                answer: "9",
                img: ""
              },
              {
                question: `Вычислить -3,43:4,9`,
                answer: "-0,7",
                img: ""
              },
              {
                question: `Вычислить 2 * 1/3 * (-(3/4))`,
                answer: "-1,75",
                img: ""
              },
              {
                question: `Вычислить 3/8:(-0,75)`,
                answer: "-0,5",
                img: ""
              },
            ],
            hard: [
              {
                question: `Найти x - (12/x) = -8,4/-6,3`,
                answer: "-9",
                img: ""
              },
              {
                question: `Найти x * 9,6/6,4 = x/-2,4`,
                answer: "-3,6",
                img: ""
              },
              {
                question: `Вычислить -12,5*(-0,08)`,
                answer: "10,04",
                img: ""
              },
              {
                question: `Найти x * - 1/7,2 = -1,7/5,1`,
                answer: "-1,4",
                img: ""
              },
              {
                question: `Найти x * 8,4/x+1 = 2,4/-1,8`,
                answer: "-7,3",
                img: ""
              },
            ]
          }
        }
      ]
    },
    {
      classID: 5,
      subject:
      [
         {
          name: "Устный счет",
          complexity: {
            easy: [
              {
                question: "27 - 4 = ?",
                answer: "23",
                img: ""
              },
              {
                question: "54 + 2 = ?",
                answer: "56",
                img: ""
              },
              {
                question: "38 - 6 = ?",
                answer: "32",
                img: ""
              },
              {
                question: "71 + 7 = ?",
                answer: "78",
                img: ""
              },
              {
                question: "21 : 7 = ?",
                answer: "3",
                img: ""
              },
              {
                question: "12 : 6 = ?",
                answer: "2",
                img: ""
              },
              {
                question: "0 * 3 = ?",
                answer: "0",
                img: ""
              },
              {
                question: "9 : 1 = ?",
                answer: "9",
                img: ""
              },
              {
                question: "9 : 3 = ?",
                answer: "3",
                img: ""
              },
              {
                question: "630 : 9 = ?",
                answer: "70",
                img: ""
              },
              {
                question: "120 : 2 = ?",
                answer: "60",
                img: ""
              },
              {
                question: "15 * 8 = ?",
                answer: "120",
                img: ""
              },
              {
                question: "76 : 4 = ?",
                answer: "19",
                img: ""
              },
              {
                question: "65 + 3 = ?",
                answer: "68",
                img: ""
              },
              {
                question: "27 - 4 = ?",
                answer: "23",
                img: ""
              },
              {
                question: "34 + 2 = ?",
                answer: "36",
                img: ""
              },
              {
                question: "62 + 2 = ?",
                answer: "64",
                img: ""
              },
              {
                question: "37 - 1 = ?",
                answer: "36",
                img: ""
              },
              {
                question: "78 + 2 = ?",
                answer: "80",
                img: ""
              },
              {
                question: "87 - 2 = ?",
                answer: "85",
                img: ""
              },
              {
                question: "7 * 4 = ?",
                answer: "28",
                img: ""
              },
            ],
            medium: [
              {
                question: "0,2 * 3 = ?",
                answer: "0,6",
                img: ""
              },
              {
                question: "4/5 = ?",
                answer: "0,8",
                img: ""
              },
              {
                question: "10 - 1 * 10 = ?",
                answer: "0",
                img: ""
              },
              {
                question: "6 : 5 = ?",
                answer: "1,2",
                img: ""
              },
              {
                question: "0,02 * 10 = ?",
                answer: "0,2",
                img: ""
              },
              {
                question: "0,02 * 10 = ?",
                answer: "0,2",
                img: ""
              },
              {
                question: "2/5 = ?",
                answer: "0,4",
                img: ""
              },
              {
                question: "8 : 5 = ?",
                answer: "1,6",
                img: ""
              },
              {
                question: "0,8 * 8 = ?",
                answer: "6,4",
                img: ""
              },
              {
                question: "6,4 * 2 = ?",
                answer: "12,8",
                img: ""
              },
              {
                question: "1,6 * 16 = ?",
                answer: "25,6",
                img: ""
              },
            ],
            hard: [
              {
                question: "5х = 2",
                answer: "0,4",
                img: ""
              },
              {
                question: "5х = 7",
                answer: "1,4",
                img: ""
              },
              {
                question: "0,32 : 0,2 = ?",
                answer: "1,6",
                img: ""
              },
              {
                question: "0,36 * 5 = ?",
                answer: "1,8",
                img: ""
              },
              {
                question: "0,36 * 5 = ?",
                answer: "1,8",
                img: ""
              },
              {
                question: "1/1/2 = ?",
                answer: "2",
                img: ""
              },
              {
                question: "10x = 1",
                answer: "0,1",
                img: ""
              },
              {
                question: "1/8 - 2 : 80 = ?",
                answer: "0,8",
                img: ""
              },
              {
                question: "5x = 16",
                answer: "3,2",
                img: ""
              },
            ]
          }
        },
        {
          name: "Задания на логику",
          complexity: {
            easy: [
              {
                question: "Кирпич весит полкирпича и еще 2 килограмма. Сколько весит кирпич?",
                answer: "4",
                img: ""
              },
            ],
            medium: [
              {
                question: `На вопрос, кто из трех абитуриентов A, B, C может работать на компьютере, был получен ответ: если может работать B, то может работать и C, но не верно, что если может работать A, то может работать и C. Кто из трех абитуриентов может работать на персональном компьютере?\n1) A\n2) В\n3) С\n4) A и B\n5)A и C\n6) B и C\n7) Все`,
                answer: "6",
                img: ""
              },
            ],
            hard: [
              {
                question: `Кто из друзей (Иван, Петр, Алексей, Николай или Борис) коллекционирует марки, если известно, что:
                \n- если Борис коллекционирует марки, то их коллекционируют Иван и Николай;
                \n- если их коллекционирует Иван, то Петр тоже коллекционирует марки;
                \n- из двух друзей (Петра и Алексея) коллекционирует марки только один;
                \n- Алексей лишь в том случае коллекционирует марки, если их коллекционирует Николай;
                \n- по крайней мере, Николай или Борис коллекционирует марки.
                \n1)Петр и Борис
                \n2)Петр
                \n3)Алексей, Борис, Петр и Николай
                \n4)Петр, Николай, Иван и Борис
                \n5)Борис, Иван, Алексей и Петр
                \n6)Алексей и Иван
                \n7) Все`,
                answer: "6",
                img: ""
              },
            ],
          }
        },
        {
          name: "Геометрическое видение",
          complexity: {
            easy: [
              {
                question: ``,
                answer: "45",
                img: "img/class5/class5_room3_easy_1.jpg"
              },
              {
                question: ``,
                answer: "72",
                img: "img/class5/class5_room3_easy_2.jpg"
              },
              {
                question: ``,
                answer: "27",
                img: "img/class5/class5_room3_easy_3.jpg"
              },
              {
                question: ``,
                answer: "28",
                img: "img/class5/class5_room3_easy_4.jpg"
              },
              {
                question: ``,
                answer: "72",
                img: "img/class5/class5_room3_easy_5.jpg"
              },
            ],
            medium: [
              {
                question: ``,
                answer: "154",
                img: "img/class5/class5_room3_normal_1.jpg"
              },
              {
                question: ``,
                answer: "110",
                img: "img/class5/class5_room3_normal_2.jpg"
              },
              {
                question: ``,
                answer: "112",
                img: "img/class5/class5_room3_normal_3.jpg"
              },
              {
                question: ``,
                answer: "112",
                img: "img/class5/class5_room3_normal_4.jpg"
              },
              {
                question: ``,
                answer: "35",
                img: "img/class5/class5_room3_normal_5.jpg"
              },
            ],
            hard: [
              {
                question: ``,
                answer: "520",
                img: "img/class5/class5_room3_hard_1.jpg"
              },
              {
                question: ``,
                answer: "875",
                img: "img/class5/class5_room3_hard_2.jpg"
              },
              {
                question: ``,
                answer: "30",
                img: "img/class5/class5_room3_hard_3.jpg"
              },
              {
                question: ``,
                answer: "28",
                img: "img/class5/class5_room3_hard_4.jpg"
              },
              {
                question: ``,
                answer: "44",
                img: "img/class5/class5_room3_hard_5.jpg"
              },
            ]
          }
        },
        {
          name: "Текстовые задачи",
          complexity: {
            easy: [
              {
                question: `Ваня купил два батона хлеба, полкило колбасы и полтора килограмма картошки. Один батон хлеба стоит 23 рубля, один килограмм колбасы 360 рублей, а один килограмм картошки — 40 рублей. Какую сдачу получит Ваня с 500 рублей?`,
                answer: "214",
                img: ""
              },
              {
                question: `Лена купила два пирожка, килограмм персиков и полтора килограмма груш. Один пирожок стоит 27 рублей, один килограмм персиков — 350 рублей, а один килограмм груш — 30 рублей. Какую сдачу получит Лена с 500 рублей?`,
                answer: "51",
                img: ""
              },
              {
                question: `Лиза купила два пирожных, полкило ветчины и полтора килограмма слив. Одно пирожное стоит 25 рублей, один килограмм ветчины — 460 рублей, а один килограмм слив — 42 рубля. Какую сдачу получит Лиза с 500 рублей?`,
                answer: "157",
                img: ""
              },
              {
                question: `Бабушка купила 9 мотков шерсти белого и красного цвета. За красные мотки она заплатила 320 руб., а за белые 400 руб. Сколько белых мотков купила бабушка, если все мотки стоили одинаково?`,
                answer: "5",
                img: ""
              },
              {
                question: `Максим купил два ананаса, полкило сыра и два килограмма винограда. Один ананас стоит 24 рубля, один килограмм сыра — 480 рублей, а один килограмм винограда — 50 рублей. Какую сдачу получит Максим с 500 рублей?`,
                answer: "112",
                img: ""
              },
            ],
            medium: [
              {
                question: `Билет на новогоднее представление «Приключение в Снежном королевстве» стоит для взрослого 400 руб., для школьника — половину стоимости взрослого билета, а для дошкольника — четверть стоимости взрослого билета. Сколько рублей должна заплатить за билеты семья, включающая двух родителей, двух школьников и одного двухлетнего малыша?`,
                answer: "1300",
                img: ""
              },
              {
                question: `Билет на цирковое представление «Планета обезьян» стоит для взрослого 700 руб., для школьника — половину стоимости взрослого билета, а для дошкольника — четверть стоимости взрослого билета. Сколько рублей должна заплатить за билеты семья, включающая двух родителей, двух школьников и одного пятилетнего малыша?`,
                answer: "2275",
                img: ""
              },
              {
                question: `2 пары туфель стоят в магазине 1380 рублей. Сколько нужно заплатить за 3 пары сапог, если стоимость пары сапог на 370 руб. дороже, чем пары туфель?`,
                answer: "3180",
                img: ""
              },
              {
                question: `Килограмм масла стоил 240 рублей. После подорожания цена выросла на 1/8, но потом уменьшилась на 1/9. Сколько после этого стоит килограмм масла?`,
                answer: "240",
                img: ""
              },
              {
                question: `Билет на вход в контактный зоопарк стоит для взрослого 300 руб., для школьника — половину стоимости взрослого билета, а для дошкольника — треть стоимости взрослого билета. Сколько рублей должна заплатить за билеты семья, включающая двух родителей, двух школьников и одного трехлетнего малыша?`,
                answer: "1000",
                img: ""
              },
            ],
            hard: [
              {
                question: ``,
                answer: "248",
                img: "img/class5/class5_room4_hard_1.jpg"
              },
              {
                question: `Билет на спектакль «Снежная королева» стоит для взрослого 1200 руб., для школьника — половину стоимости взрослого билета, а для дошкольника четверть стоимости взрослого билета. Сколько рублей должна заплатить за билеты семья, включающая двух родителей, двух школьников и одного трёхлетнего малыша?`,
                answer: "3900",
                img: ""
              },
              {
                question: `В магазине купили 4 чашки по 54 руб. и 2 стакана. Сколько стоят 4 чашки и 2 стакана, если стакан в 2 раза дешевле чашки?`,
                answer: "270",
                img: ""
              },
              {
                question: `Бутылка лимонада стоит 35 к., а пустая бутылка 20 к. Купили дюжину (дюжина — 12) бутылок лимонада, а в обмен сдали 8 пустых бутылок. Сколько копеек доплатили?`,
                answer: "260",
                img: ""
              },
              {
                question: `В магазин привезли 250 коробок, в каждой коробке по 54 пачки печенья. Сколько денег выручит магазин от продажи этого печенья, если одна пачка печенья стоит 32 к.?`,
                answer: "432000",
                img: ""
              },
            ]
          }
        },
        {
          name: "Сравнение дробей",
          complexity: {
            easy: [
              {
                question: `Выбрать наибольшую дробь. 1) 8/3 2) 9/7 3) 10/5 4) 5/10`,
                answer: "1",
                img: ""
              },
              {
                question: `Выбрать наибольшую дробь. 1) 5/5 2) 6/9 3) 10/3 4) 2/8`,
                answer: "3",
                img: ""
              },
              {
                question: `Выбрать наибольшую дробь. 1) 6/5 2) 7/4 3) 3/8 4) 7/2`,
                answer: "4",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 10/9 2) 9/9 3) 4/2 4) 2/5`,
                answer: "4",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 2/2 2) 8/2 3) 5/9 4) 4/10`,
                answer: "4",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 4/9 2) 5/2 3) 1/9 4) 9/6`,
                answer: "2",
                img: ""
              },
            ],
            medium: [
              {
                question: `Выбрать наибольшую дробь. 1) 53/37 2) 30/7 3) 92/73 4) 99/23`,
                answer: "4",
                img: ""
              },
              {
                question: `Выбрать наибольшую дробь. 1) 38/83 2) 10/76 3) 72/28 4) 86/67`,
                answer: "3",
                img: ""
              },
              {
                question: `Выбрать наибольшую дробь. 1) 4/27 2) 90/46 3) 64/82 4) 90/28`,
                answer: "4",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 46/64 2) 3/28 3) 87/50 4) 12/66`,
                answer: "2",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 45/11 2) 18/61 3) 56/90 4) 25/62`,
                answer: "2",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 65/12 2) 97/27 3) 31/35 4) 35/97`,
                answer: "4",
                img: ""
              },
            ],
            hard: [
              {
                question: `Выбрать наибольшую дробь. 1) 32/820 2) 80/958 3) 321/535 4) 163/939`,
                answer: "3",
                img: ""
              },
              {
                question: `Выбрать наибольшую дробь. 1) 29/780 2) 284/535 3) 18/781 4) 76/655`,
                answer: "2",
                img: ""
              },
              {
                question: `Выбрать наибольшую дробь. 1) 759/854 2) 240/854 3) 240/645 4) 774/908`,
                answer: "1",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 128/743 2) 733/643 3) 111/747 4) 409/822`,
                answer: "3",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 334/664 2) 245/258 3) 431/977 4) 327/609`,
                answer: "3",
                img: ""
              },
              {
                question: `Выбрать наименьшую дробь. 1) 406/682 2) 496/849 3) 839/942 4) 724/94`,
                answer: "3",
                img: ""
              },
            ]
          }
        },
        {
          name: "Дроби",
          complexity: {
            easy: [
              {
                question: `Вычислить, в ответ указать сумму числителя и знаменателяю. 2/7 + 3/7`,
                answer: "12",
                img: ""
              },
              {
                question: `Треть числа равна 27. Найти это число.`,
                answer: "81",
                img: ""
              },
              {
                question: `Сократить дробь 9/21. В ответе указать сумму числителя и знаменателя.`,
                answer: "10",
                img: ""
              },
              {
                question: `Сократить дробь 15/36. В ответе указать сумму числителя и знаменателя.`,
                answer: "17",
                img: ""
              },
              {
                question: `Вычислить 47/9-2/9`,
                answer: "5",
                img: ""
              },
            ],
            medium: [
              {
                question: `Какое число нужно вписать, чтобы равенство стало верным? 12/18 = ?/3`,
                answer: "2",
                img: ""
              },
              {
                question: `Какое число нужно вписать, чтобы равенство стало верным? 8/36=?/9`,
                answer: "2",
                img: ""
              },
              {
                question: `Какое число нужно вписать, чтобы равенство стало верным? 9/27=?/3`,
                answer: "1",
                img: ""
              },
              {
                question: `Какое число нужно вписать, чтобы равенство стало верным? 24/54=?/9`,
                answer: "4",
                img: ""
              },
              {
                question: `Какое число нужно вписать, чтобы равенство стало верным? 14/63=?/9`,
                answer: "2",
                img: ""
              },
            ],
            hard: [
              {
                question: `Сколько минут в 1/10 часа?`,
                answer: "6",
                img: ""
              },
              {
                question: `Сколько минут в 3/4 часа?`,
                answer: "45",
                img: ""
              },
              {
                question: `Сложите 2/5 числа 40 и 2/3 числа 60. `,
                answer: "56",
                img: ""
              },
              {
                question: `Из 5/6 числа 72 вычтите 2/9 числа 81.`,
                answer: "42",
                img: ""
              },
              {
                question: `Сложите 3/5 числа 20 и 1/6 числа 18.`,
                answer: "15",
                img: ""
              },
            ]
          }
        }
      ]
    },
    {
      classID: 4,
      subject:
      []
    },
    {
      classID: 3,
      subject:
      []
    },
    {
      classID: 2,
      subject:
      []
    },
    {
      classID: 1,
      subject:
      []
    },
  ]
};

const questions = {
  complexity: ["easy", "medium", "hard"],
  class1: [
    {
      name: "Устный счет #1",
      listQuestions: [
        {
          question: "2 + 2 = ?",
          answer: "4",
        },
        {
          question: "23 + 42 = ?",
          answer: "65",
        },
        {
          question: "21 * 10 = ?",
          answer: "210",
        },
        {
          question: "10 + 2 = ?",
          answer: "12",
        },
      ],
    },
    {
      name: "Устный счет #2",
      listQuestions: [
        {
          question: "2 + 2 = ?",
          answer: "4",
        },
        {
          question: "23 + 42 = ?",
          answer: "65",
        },
        {
          question: "21 * 10 = ?",
          answer: "210",
        },
        {
          question: "10 + 2 = ?",
          answer: "12",
        },
      ],
    },
    {
      name: "Устный счет #3",
      listQuestions: [
        {
          question: "2 + 2 = ?",
          answer: "4",
        },
        {
          question: "23 + 42 = ?",
          answer: "65",
        },
        {
          question: "21 * 10 = ?",
          answer: "210",
        },
        {
          question: "10 + 2 = ?",
          answer: "12",
        },
      ],
    },
    {
      name: "Устный счет #4",
      listQuestions: [
        {
          question: "2 + 2 = ?",
          answer: "4",
        },
        {
          question: "23 + 42 = ?",
          answer: "65",
        },
        {
          question: "21 * 10 = ?",
          answer: "210",
        },
        {
          question: "10 + 2 = ?",
          answer: "12",
        },
      ],
    },
    {
      name: "Устный счет #5",
      listQuestions: [
        {
          question: "2 + 2 = ?",
          answer: "4",
        },
        {
          question: "23 + 42 = ?",
          answer: "65",
        },
        {
          question: "21 * 10 = ?",
          answer: "210",
        },
        {
          question: "10 + 2 = ?",
          answer: "12",
        },
      ],
    },
    {
      name: "Устный счет #6",
      listQuestions: [
        {
          question: "2 + 2 = ?",
          answer: "4",
        },
        {
          question: "23 + 42 = ?",
          answer: "65",
        },
        {
          question: "21 * 10 = ?",
          answer: "210",
        },
        {
          question: "10 + 2 = ?",
          answer: "12",
        },
      ],
    },
    {
      name: "Устный счет #7",
      listQuestions: [
        {
          question: "2 + 2 = ?",
          answer: "4",
        },
        {
          question: "23 + 42 = ?",
          answer: "65",
        },
        {
          question: "21 * 10 = ?",
          answer: "210",
        },
        {
          question: "10 + 2 = ?",
          answer: "12",
        },
      ],
    },
    {
      name: "Устный счет #8",
      listQuestions: [
        {
          question: "2 + 2 = ?",
          answer: "4",
        },
        {
          question: "23 + 42 = ?",
          answer: "65",
        },
        {
          question: "21 * 10 = ?",
          answer: "210",
        },
        {
          question: "10 + 2 = ?",
          answer: "12",
        },
      ],
    },
  ],
}


function download() {
  var a = document.body.appendChild(
     document.createElement("a")
  );
 a.download = "report.html";
 a.href = "data:text/html," + document.getElementById("content").innerHTML;
 a.click(); //Trigger a click on the element
}

const questionText = document.querySelector(".question__text");
const questionTitle = document.querySelector(".question__title");
const questionImg = document.querySelector(".question__img");

const reply = document.querySelector("#reply");
// const randomSubject = Math.floor(Math.random() * questions.class1.length);

const randomSubject = 0;
const submit = document.querySelector(".form-submit");
const question_result = document.querySelector(".question_result");

let stepQuestion = 0;

questionTitle.textContent = questions.class1[randomSubject].name;
questionText.textContent =
questions.class1[randomSubject].listQuestions[stepQuestion].question;



/* -------------- [ Авторизация ] -------------- */

// Получаем ID класса
let classID
// Random
let random = ""
// Уровень сложности
let complexity = 1
//Флаги
let flag = 1

let roomAmount
/* -------------- [ Отчет ] -------------- */

const createListReports = (roomAmount, classID) => {
  
  const reportBlock = document.querySelector('.report')
  const dataClass = data.classes[classID]

  for(let i = 0; i < roomAmount; i++) {
    const blockSubject = document.createElement("div")
    blockSubject.className = "blockSubject"

    const blockSubject_title = document.createElement("h2")
    blockSubject_title.className = "blockSubject__title"

    blockSubject_title.textContent = dataClass.subject[i].name

    blockSubject.appendChild(blockSubject_title)
    reportBlock.appendChild(blockSubject)
  }
}

const addReport = (subject, question, answer, flag, level, img) => {
  const listSubject = document.querySelectorAll(".blockSubject__title")
  listSubject.forEach(el => {
    if(subject === el.textContent) {
      const parent = el.closest(".blockSubject")
      const result = document.createElement("div")
      const titleLevel = document.createElement("p")

      result.className = "blockSubject__answer"
      titleLevel.className = "blockSubject__level"

      if(level === "easy") {
        titleLevel.textContent = "Уровень: Легко"
        if(flag == 1) {
          result.innerHTML = "Вопрос: " + question + "<img class=\"report__image\" src=\"" + img + "\">" + "<br>Ответ: " + answer + " | <span style=\"color: springgreen\">Правильно</span>"
        } else {
          result.innerHTML = "Вопрос: " + question + "<img class=\"report__image\" src=\"" + img + "\">" + "<br>Ответ: " + answer + " | <span style=\"color: tomato\">Неправильно</span>"
        }
        parent.appendChild(titleLevel)
        parent.appendChild(result)
      } else if(level === "medium") {
          titleLevel.textContent = "Уровень: Средне"
          if(flag == 1) {
            result.innerHTML = "Вопрос: " + question + "<img class=\"report__image\" src=\"" + img + "\">" + "<br>Ответ: " + answer + " | <span style=\"color: springgreen\">Правильно</span>"
          } else {
            result.innerHTML = "Вопрос: " + question + "<img class=\"report__image\" src=\"" + img + "\">" + "<br>Ответ: " + answer + " | <span style=\"color: tomato\">Неправильно</span>"
          }
          parent.appendChild(titleLevel)
          parent.appendChild(result)
      } else if(level === "hard") {
        titleLevel.textContent = "Уровень: Тяжело"
        if(flag == 1) {
          result.innerHTML = "Вопрос: " + question + "<img class=\"report__image\" src=\"" + img + "\">" + "<br>Ответ: " + answer + " | <span style=\"color: springgreen\">Правильно</span>"
        } else {
          result.innerHTML = "Вопрос: " + question + "<img class=\"report__image\" src=\"" + img + "\">" + "<br>Ответ: " + answer + " | <span style=\"color: tomato\">Неправильно</span>"
        }
        parent.appendChild(titleLevel)
        parent.appendChild(result)
    }
    }
  })
}

submit.addEventListener("click", (e) => {
  e.preventDefault();
  const userName = document.querySelector("#name").value;
  const userSurname = document.querySelector("#surname").value;
  const userPatronymic = document.querySelector("#patronymic").value;
  const userPhone = document.querySelector("#phone").value;
  const userDate = document.querySelector("#date").value;
  const userClass = document.querySelector("#class").value;
  const userEmail = document.querySelector("#email").value;
  let formListEnter = ""

  if(userName == "") {
    formListEnter += "Имя\n";
  }
  if(userSurname == "") {
    formListEnter += "Фамилия\n";
  }
  if(userPatronymic == "") {
    formListEnter += "Отчество\n";
  }
  if(userPhone == "") {
    formListEnter += "Телефон\n";
  }
  if(userDate == "") {
    formListEnter += "Дата рождения\n";
  }
  if(userClass == "") {
    formListEnter += "Класс\n";
  }
  else if(userClass <= 4 || userClass > 9) {
    formListEnter += "Номер класса от 1 до 9\n"
  }
  if(userEmail == "") {
    formListEnter += "Почта\n";
  }

  if(formListEnter != "") {
    alert("Введите пожалуйста данные: \n" + formListEnter)
  } else {

    // Получаем ID класса для составление вопросов
    classID = data.classes.map(e => e.classID).indexOf(parseInt(userClass))
    roomAmount = data.classes[classID].subject.length
    createListReports(roomAmount, classID)

    console.log(`Выбран класс: ${userClass} | ID класса: ${classID} | Кол-во кабинетов: ${roomAmount}`)


    document.querySelector(".report__span-surname").textContent = userSurname
    document.querySelector(".report__span-name").textContent = userName
    document.querySelector(".report__span-patronymic").textContent = userPatronymic
    document.querySelector(".report__span-phone").textContent = userPhone
    document.querySelector(".report__span-date").textContent = userDate
    document.querySelector(".report__span-class").textContent = userClass

    const spanUser = document.querySelector(".info__username");
    spanUser.textContent = userName || "def";

    const spanClass = document.querySelector(".info__userclass");
    spanClass.textContent = userClass || "def";
  
    const authField = document.querySelector(".auth");
    authField.style.display = "none";
  }


});



const question = document.querySelector(".question");

var character = document.querySelector(".character");
var map = document.querySelector(".map");
let id

/* -------------- [ Конфиг placeBlocks ] -------------- */
const placeBlocks = {
  props: [
    {top: 71, left: 18, width: 10, height: 5},  // class 1
    {top: 49, left: 18, width: 10, height: 5},  // class 2
    {top: 28, left: 18, width: 10, height: 5},  // class 3
    {top: 6, left: 18, width: 10, height: 5},   // class 4
    {top: 6, left: 73, width: 10, height: 5},   // class 5
    {top: 28, left: 73, width: 10, height: 5},  // class 6
    {top: 49, left: 73, width: 10, height: 5},  // class 7
    {top: 71, left: 73, width: 10, height: 5},  // class 8
    
  ]
}

/* -------------- [ Создание placeBlocks ] -------------- */
for (let i = 0; i < placeBlocks.props.length; i++) {
  const placeBlock = document.createElement("div");
  placeBlock.className = "placeBlock";
  placeBlock.style.width = placeBlocks.props[i].width + "%";
  placeBlock.style.height = placeBlocks.props[i].height + "%";
  placeBlock.style.top = placeBlocks.props[i].top + "%";
  placeBlock.style.left = placeBlocks.props[i].left + "%";
  map.appendChild(placeBlock);
}

/* -------------- [ Позиции placeBlocks ] -------------- */
let positionBlocks = {
  places: [
    {x: 0, right: 0, y: 0, bottom: 0},
    {x: 0, right: 0, y: 0, bottom: 0},
    {x: 0, right: 0, y: 0, bottom: 0},
    {x: 0, right: 0, y: 0, bottom: 0},
    {x: 0, right: 0, y: 0, bottom: 0},
    {x: 0, right: 0, y: 0, bottom: 0},
    {x: 0, right: 0, y: 0, bottom: 0},
    {x: 0, right: 0, y: 0, bottom: 0},
  ]
}

  // {
  // x: {type: Number}, right: {type: Number}, y: {type: Number}, bottom: {type: Number}
  // }

const blocks = document.querySelectorAll(".placeBlock");



const wall = document.querySelector(".wall");
const wallLong = document.querySelector(".wall-long");

var pixelSize = parseInt(
  getComputedStyle(document.documentElement).getPropertyValue("--pixel-size")
);
var leftLimit = -8;
var rightLimit = 230;
var topLimit = 0;
var bottomLimit = 320;

var wallShortLeft = 85;
var wallShortRight = 140;

const objWall = {
  props: [
    { x: 0, y: 233, width: 385, height: 50 },
    { x: 0, y: 68, width: 385, height: 50 },
    { x: 0, y: 150, width: 385, height: 50 },
    { x: 0, y: 233, width: 385, height: 50 },
    { x: 0, y: 315, width: 428, height: 50 },

    { x: 159, y: 233, width: 385, height: 50 },
    { x: 159, y: 68, width: 385, height: 50 },
    { x: 159, y: 150, width: 385, height: 50 },
    { x: 159, y: 233, width: 385, height: 50 },
    { x: 148, y: 315, width: 428, height: 50 },
  ],
};

const objLongWall = {
  props: [
    { x: 96, y: 278, width: 5, height: 150 },
    { x: 96, y: 198, width: 5, height: 160 },
    { x: 96, y: 112, width: 5, height: 160 },
    { x: 96, y: 30, width: 5, height: 160 },

    { x: 158, y: 278, width: 5, height: 150 },
    { x: 158, y: 198, width: 5, height: 150 },
    { x: 158, y: 112, width: 5, height: 150 },
    { x: 158, y: 30, width: 5, height: 150 },
  ],
};

for (let i = 0; i < objLongWall.props.length; i++) {
  const wall = document.createElement("div");
  wall.className = "long-wall";
  wall.style.width = objLongWall.props[i].width + "px";
  wall.style.height = objLongWall.props[i].height + "px";
  wall.style.transform = `translate3d( ${
    objLongWall.props[i].x * pixelSize
  }px, ${objLongWall.props[i].y * pixelSize}px, 0 )`;
  map.appendChild(wall);
}

for (let i = 0; i < objWall.props.length; i++) {
  const wall = document.createElement("div");
  wall.className = "wall";
  wall.style.width = objWall.props[i].width + "px";
  wall.style.height = objWall.props[i].height + "px";
  wall.style.transform = `translate3d( ${objWall.props[i].x * pixelSize}px, ${
    objWall.props[i].y * pixelSize
  }px, 0 )`;
  map.appendChild(wall);
}

const wallPositionY = 95;
//start in the middle of the map
var x = 112;
var y = 290;
var held_directions = []; //State of which arrow keys we are holding down
var speed = 1.0; //How fast the character moves in pixels per frame

const placeCharacter = () => {
  const held_direction = held_directions[0];
  if (held_direction) {
    if (held_direction === directions.right) {
      x += speed;
    }
    if (held_direction === directions.left) {
      x -= speed;
    }
    if (held_direction === directions.down) {
      y += speed;
    }
    if (held_direction === directions.up) {
      y -= speed;
    }
    character.setAttribute("facing", held_direction);
  }
  character.setAttribute("walking", held_direction ? "true" : "false");

  const characterX0 = character.getBoundingClientRect().x;
  const characterX1 = character.getBoundingClientRect().right;

  const characterY0 = character.getBoundingClientRect().y;
  const characterY1 = character.getBoundingClientRect().bottom;

  // blocks.forEach(element => {
  //     positionBlocks.push({x: element.getBoundingClientRect().x, right: element.getBoundingClientRect().right, y: element.getBoundingClientRect().y, bottom: element.getBoundingClientRect().bottom})
    
  // });

  for(let i = 0; i < placeBlocks.props.length; i++) {
    positionBlocks.places[i] = {
      x: blocks[i].getBoundingClientRect().x,
      right: blocks[i].getBoundingClientRect().right,
      y: blocks[i].getBoundingClientRect().y,
      bottom: blocks[i].getBoundingClientRect().bottom,
    }
  }

  //Limits (gives the illusion of walls)

  // console.log("y = " + parseInt(y) + " | wallPositionY = " + wallPositionY);
  if (x < leftLimit) {
    x = leftLimit;
  }
  if (x > rightLimit) {
    x = rightLimit;
  }
  if (y < topLimit) {
    y = topLimit;
  }
  if (y > bottomLimit) {
    y = bottomLimit;
  }

  // Проверка на стены
  for (let i = 0; i < objWall.props.length; i++) {
    if (objWall.props[i].y + 15 == y && x <= wallShortLeft) {
      y = objWall.props[i].y + 16;
    } else if (objWall.props[i].y - 10 == y && x <= wallShortLeft) {
      y = objWall.props[i].y - 11;
    } else if (objWall.props[i].y - 10 == y && x >= wallShortRight) {
      y = objWall.props[i].y - 11;
    } else if (objWall.props[i].y + 15 == y && x >= wallShortRight) {
      y = objWall.props[i].y + 16;
    }
  }

  for (let i = 0; i < objLongWall.props.length; i++) {
    if (
      objLongWall.props[i].x - 8 == x &&
      y >= objLongWall.props[i].y - 12 &&
      objLongWall.props[i].y + 60 >= y
    ) {
      x = objLongWall.props[i].x - 7;
    } else if (
      objLongWall.props[i].x - 20 == x &&
      y >= objLongWall.props[i].y - 12 &&
      objLongWall.props[i].y + 60 >= y
    ) {
      x = objLongWall.props[i].x - 21;
    }
  }

  var camera_left = pixelSize * 66;
  var camera_top = pixelSize * 42;

  map.style.transform = `translate3d( ${-x * pixelSize + camera_left}px, ${
    -y * pixelSize + camera_top
  }px, 0 )`;
  character.style.transform = `translate3d( ${x * pixelSize}px, ${
    y * pixelSize
  }px, 0 )`;

  if (
    roomAmount >= 1 &&
    characterX0 >= positionBlocks.places[0].x - 50 &&
    characterX1 <= positionBlocks.places[0].right + 50 &&
    characterY0 >= positionBlocks.places[0].y - 100 &&
    characterY1 <= positionBlocks.places[0].bottom + 30 &&
    (blocks[0].classList[1] != "block-item__success" && 
    blocks[0].classList[1] != "block-item__disabled")
  ) {

    id = 0
    if(random.length == "" && complexity == 1) {
      random = Math.floor(Math.random() * data.classes[classID].subject[id].complexity.easy.length)
    } else if (random.length == "" && complexity == 2){
      random = Math.floor(Math.random() * data.classes[classID].subject[id].complexity.medium.length)
    } else if (random.length == "" && complexity == 3){
      random = Math.floor(Math.random() * data.classes[classID].subject[id].complexity.hard.length)
    }
    questionStart(random);
  } 
  else if (
    roomAmount >= 2 &&
    characterX0 >= positionBlocks.places[1].x - 50 &&
    characterX1 <= positionBlocks.places[1].right + 50 &&
    characterY0 >= positionBlocks.places[1].y - 100 &&
    characterY1 <= positionBlocks.places[1].bottom + 30 &&
    (blocks[1].classList[1] != "block-item__success" && 
    blocks[1].classList[1] != "block-item__disabled")
  ) {
    id = 1
    if(random.length == "" && complexity == 1) {
      random = Math.floor(Math.random() * data.classes[classID].subject[id].complexity.easy.length)
    } else if (random.length == "" && complexity == 2){
      random = Math.floor(Math.random() * data.classes[classID].subject[id].complexity.medium.length)
    } else if (random.length == "" && complexity == 3){
      random = Math.floor(Math.random() * data.classes[classID].subject[id].complexity.hard.length)
    }
    questionStart(random);
  } else if (
    roomAmount >= 3 &&
    characterX0 >= positionBlocks.places[2].x - 50 &&
    characterX1 <= positionBlocks.places[2].right + 50 &&
    characterY0 >= positionBlocks.places[2].y - 100 &&
    characterY1 <= positionBlocks.places[2].bottom + 30 &&
    (blocks[2].classList[1] != "block-item__success" && 
    blocks[2].classList[1] != "block-item__disabled")
  ) {
    id = 2
    if(random.length == "" && complexity == 1) {
      random = Math.floor(Math.random() * data.classes[classID].subject[id].complexity.easy.length)
    } else if (random.length == "" && complexity == 2){
      random = Math.floor(Math.random() * data.classes[classID].subject[id].complexity.medium.length)
    } else if (random.length == "" && complexity == 3){
      random = Math.floor(Math.random() * data.classes[classID].subject[id].complexity.hard.length)
    }
    questionStart(random);
  }
  else if (
    roomAmount >= 4 &&
    characterX0 >= positionBlocks.places[3].x - 50 &&
    characterX1 <= positionBlocks.places[3].right + 50 &&
    characterY0 >= positionBlocks.places[3].y - 100 &&
    characterY1 <= positionBlocks.places[3].bottom + 30 &&
    (blocks[3].classList[1] != "block-item__success" && 
    blocks[3].classList[1] != "block-item__disabled")
  ) {
    id = 3
    if(random.length == "" && complexity == 1) {
      random = Math.floor(Math.random() * data.classes[classID].subject[id].complexity.easy.length)
    } else if (random.length == "" && complexity == 2){
      random = Math.floor(Math.random() * data.classes[classID].subject[id].complexity.medium.length)
    } else if (random.length == "" && complexity == 3){
      random = Math.floor(Math.random() * data.classes[classID].subject[id].complexity.hard.length)
    }
    questionStart(random);
  }
  else if (
    roomAmount >= 5 &&
    characterX0 >= positionBlocks.places[4].x - 50 &&
    characterX1 <= positionBlocks.places[4].right + 50 &&
    characterY0 >= positionBlocks.places[4].y - 100 &&
    characterY1 <= positionBlocks.places[4].bottom + 30 &&
    (blocks[4].classList[1] != "block-item__success" && 
    blocks[4].classList[1] != "block-item__disabled")
  ) {
    id = 4
    if(random.length == "" && complexity == 1) {
      random = Math.floor(Math.random() * data.classes[classID].subject[id].complexity.easy.length)
    } else if (random.length == "" && complexity == 2){
      random = Math.floor(Math.random() * data.classes[classID].subject[id].complexity.medium.length)
    } else if (random.length == "" && complexity == 3){
      random = Math.floor(Math.random() * data.classes[classID].subject[id].complexity.hard.length)
    }
    questionStart(random);
  }
  else if (
    roomAmount >= 6 &&
    characterX0 >= positionBlocks.places[5].x - 50 &&
    characterX1 <= positionBlocks.places[5].right + 50 &&
    characterY0 >= positionBlocks.places[5].y - 100 &&
    characterY1 <= positionBlocks.places[5].bottom + 30 &&
    (blocks[5].classList[1] != "block-item__success" && 
    blocks[5].classList[1] != "block-item__disabled")
  ) {
    id = 5
    if(random.length == "" && complexity == 1) {
      random = Math.floor(Math.random() * data.classes[classID].subject[id].complexity.easy.length)
    } else if (random.length == "" && complexity == 2){
      random = Math.floor(Math.random() * data.classes[classID].subject[id].complexity.medium.length)
    } else if (random.length == "" && complexity == 3){
      random = Math.floor(Math.random() * data.classes[classID].subject[id].complexity.hard.length)
    }
    questionStart(random);
  }
  else if (
    roomAmount >= 7 &&
    characterX0 >= positionBlocks.places[6].x - 50 &&
    characterX1 <= positionBlocks.places[6].right + 50 &&
    characterY0 >= positionBlocks.places[6].y - 100 &&
    characterY1 <= positionBlocks.places[6].bottom + 30 &&
    (blocks[6].classList[1] != "block-item__success" && 
    blocks[6].classList[1] != "block-item__disabled")
  ) {
    id = 6
    if(random.length == "" && complexity == 1) {
      random = Math.floor(Math.random() * data.classes[classID].subject[id].complexity.easy.length)
    } else if (random.length == "" && complexity == 2){
      random = Math.floor(Math.random() * data.classes[classID].subject[id].complexity.medium.length)
    } else if (random.length == "" && complexity == 3){
      random = Math.floor(Math.random() * data.classes[classID].subject[id].complexity.hard.length)
    }
    questionStart(random);
  }
  else if (
    roomAmount >= 8 &&
    characterX0 >= positionBlocks.places[7].x - 50 &&
    characterX1 <= positionBlocks.places[7].right + 50 &&
    characterY0 >= positionBlocks.places[7].y - 100 &&
    characterY1 <= positionBlocks.places[7].bottom + 30 &&
    (blocks[7].classList[1] != "block-item__success" && 
    blocks[7].classList[1] != "block-item__disabled")
  ) {
    id = 7
    if(random.length == "" && complexity == 1) {
      random = Math.floor(Math.random() * data.classes[classID].subject[id].complexity.easy.length)
    } else if (random.length == "" && complexity == 2){
      random = Math.floor(Math.random() * data.classes[classID].subject[id].complexity.medium.length)
    } else if (random.length == "" && complexity == 3){
      random = Math.floor(Math.random() * data.classes[classID].subject[id].complexity.hard.length)
    }
    questionStart(random);
  }
  else {
    if(roomAmount < 8) {
      blocks[7].classList.add("block-item__unuse");
    }
    if(roomAmount < 7) {
      blocks[6].classList.add("block-item__unuse");
    }
    if(roomAmount < 6) {
      blocks[5].classList.add("block-item__unuse");
    }
    if(roomAmount < 5) {
      blocks[4].classList.add("block-item__unuse");
    }
    if(roomAmount < 4) {
      blocks[3].classList.add("block-item__unuse");
    }
    if(roomAmount < 3) {
      blocks[2].classList.add("block-item__unuse");
    }
    if(roomAmount < 2) {
      blocks[1].classList.add("block-item__unuse");
    }
    if(roomAmount < 1) {
      blocks[0].classList.add("block-item__unuse");
    }
    question.style.display = "none";
    random = ""
  }

  // for(let i = 0; i < positionBlocks.places.length; i++) {
  //   if (
  //     characterX0 >= positionBlocks.places[i].x - 50 &&
  //     characterX1 <= positionBlocks.places[i].right + 50 &&
  //     characterY0 >= positionBlocks.places[i].y - 100 &&
  //     characterY1 <= positionBlocks.places[i].bottom + 30 
  //     // block.classList[1] != "block-item__disabled"
  //   ) {
  //     questionStart();
  //   } else {
  //     question.style.display = "none";
  //   }
  // }
};

// Set up the game loop
const step = () => {
  placeCharacter();
  window.requestAnimationFrame(() => {
    step();
  });
};
//kick off the first step!
step();
/* Direction key state */
placeCharacter();

const directions = {
  up: "up",
  down: "down",
  left: "left",
  right: "right",
};

const keys = {
  38: directions.up,
  37: directions.left,
  39: directions.right,
  40: directions.down,
};
document.addEventListener("keydown", (e) => {
  var dir = keys[e.which];
  if (dir && held_directions.indexOf(dir) === -1) {
    held_directions.unshift(dir);
  }

  if(e.key === "p") {
    alert("PAUSE")
  }
  if(e.key === "d") {
    download()
  }
  if(e.key === "r") {
    const report = document.querySelector('.report')
    report.style.display = "flex"
  }
});

document.addEventListener("keyup", (e) => {
  var dir = keys[e.which];
  var index = held_directions.indexOf(dir);
  if (index > -1) {
    held_directions.splice(index, 1);
  }

  //   console.log("Y = ", character.getBoundingClientRect().y)
  if(e.key === "r") {
    const report = document.querySelector('.report')
    report.style.display = "none"
  }
});



function questionStart(rand) {
  question.style.display = "block";
  questionTitle.textContent = data.classes[classID].subject[id].name;
  if(complexity == 1) {
    questionText.textContent  = data.classes[classID].subject[id].complexity.easy[rand].question;
    questionImg.setAttribute("src", data.classes[classID].subject[id].complexity.easy[rand].img)
  } else if(complexity == 2) {
    questionText.textContent  = data.classes[classID].subject[id].complexity.medium[rand].question;
    questionImg.setAttribute("src", data.classes[classID].subject[id].complexity.medium[rand].img)
  } else if(complexity == 3) {
    questionText.textContent  = data.classes[classID].subject[id].complexity.hard[rand].question;
    questionImg.setAttribute("src", data.classes[classID].subject[id].complexity.hard[rand].img)
  } 

  reply.addEventListener("click", () => {
    const question__form = document.querySelector(".question__form");
  
    if(complexity == 1) {
      if (
        question__form.value ==
        data.classes[classID].subject[id].complexity.easy[random].answer
      ) {
        addReport(data.classes[classID].subject[id].name, data.classes[classID].subject[id].complexity.easy[random].question, question__form.value, 1, "easy", data.classes[classID].subject[id].complexity.easy[random].img)
        complexity = 2
        random = ""
        question__form.value = ""
      } else {
        addReport(data.classes[classID].subject[id].name, data.classes[classID].subject[id].complexity.easy[random].question, question__form.value, 0, "easy", data.classes[classID].subject[id].complexity.easy[random].img)
        blocks[id].classList.add("block-item__disabled");
          question.style.display = "none";
          question__form.value = ""
          random = ""
          complexity = 1
        }
      } else if(complexity == 2) {
        if (
          question__form.value ==
          data.classes[classID].subject[id].complexity.medium[random].answer
        ) {
          addReport(data.classes[classID].subject[id].name, data.classes[classID].subject[id].complexity.medium[random].question, question__form.value, 1, "medium", data.classes[classID].subject[id].complexity.easy[random].img)
          question__form.value = ""
          complexity = 3
          random = ""
        } else {
          addReport(data.classes[classID].subject[id].name, data.classes[classID].subject[id].complexity.medium[random].question, question__form.value, 0, "medium", data.classes[classID].subject[id].complexity.easy[random].img)
          blocks[id].classList.add("block-item__disabled");
            question.style.display = "none";
            question__form.value = ""
            random = ""
            complexity = 1
          }
      } else if(complexity == 3) {
        if (
          question__form.value ==
          data.classes[classID].subject[id].complexity.hard[random].answer
        ) {
          addReport(data.classes[classID].subject[id].name, data.classes[classID].subject[id].complexity.hard[random].question, question__form.value, 1, "hard", data.classes[classID].subject[id].complexity.easy[random].img)
          blocks[id].classList.add("block-item__success");
          question.style.display = "none";
          question__form.value = ""
          random = ""
          complexity = 1
        } else {
          addReport(data.classes[classID].subject[id].name, data.classes[classID].subject[id].complexity.hard[random].question, question__form.value, 0, "hard", data.classes[classID].subject[id].complexity.easy[random].img)
          blocks[id].classList.add("block-item__disabled");
            question.style.display = "none";
            question__form.value = ""
            random = ""
            complexity = 1
          }
      }
    });
}



const customizationPlayer = document.querySelector(".customization__player")
const characterSpritesheet =  document.querySelector(".character_spritesheet")

// ----------------- Волосы

function changeModel(hairColor) {
  let type = ""
  let tshirtColor = ""
  for(let j = 0; j < typeHair.length; j++) {
    if(typeHair[j].getAttribute("id") == "hairTypeBang" && typeHair[j].checked) {
      type = "bang"
    } else if(typeHair[j].getAttribute("id") == "hairTypeLong" && typeHair[j].checked) {
      type = "long"
    } else if(typeHair[j].getAttribute("id") == "hairTypeShort" && typeHair[j].checked) {
      type = "short"
    } else if(typeHair[j].getAttribute("id") == "hairTypeCombing" && typeHair[j].checked) {
      type = "сombing"
    } else if(typeHair[j].getAttribute("id") == "hairTypeBald" && typeHair[j].checked) {
      type = "bald"
    }

    switch(hairColor) {
      case "hairColorBlack":
        customizationPlayer.style.backgroundImage = type == "bald" ? `url(./player/hair/bald/bald.webp)` : `url(./player/hair/${type}/black.webp)`
        characterSpritesheet.style.backgroundImage = type == "bald" ? `url(./player/hair/bald/bald.webp)` : `url(./player/hair/${type}/black.webp)`
      break
      case "hairColorGray": 
        customizationPlayer.style.backgroundImage = type == "bald" ? `url(./player/hair/bald/bald.webp)` : `url(./player/hair/${type}/gray.webp)`
        characterSpritesheet.style.backgroundImage = type == "bald" ? `url(./player/hair/bald/bald.webp)` : `url(./player/hair/${type}/gray.webp)`
      break
      case "hairColorBrown":
        customizationPlayer.style.backgroundImage = type == "bald" ? `url(./player/hair/bald/bald.webp)` : `url(./player/hair/${type}/brown.webp)`
        characterSpritesheet.style.backgroundImage = type == "bald" ? `url(./player/hair/bald/bald.webp)` : `url(./player/hair/${type}/brown.webp)`
      break
      case "hairColorYellow":
        customizationPlayer.style.backgroundImage = type == "bald" ? `url(./player/hair/bald/bald.webp)` : `url(./player/hair/${type}/yellow.webp)`
        characterSpritesheet.style.backgroundImage = type == "bald" ? `url(./player/hair/bald/bald.webp)` : `url(./player/hair/${type}/yellow.webp)`
      break
    }
  }
}

const colorHair = [
  document.querySelector("#hairColorBlack"),
  document.querySelector("#hairColorGray"),
  document.querySelector("#hairColorBrown"),
  document.querySelector("#hairColorYellow"),
]

const typeHair = [
  document.querySelector("#hairTypeBald"),
  document.querySelector("#hairTypeBang"),
  document.querySelector("#hairTypeLong"),
  document.querySelector("#hairTypeShort"),
  document.querySelector("#hairTypeCombing"),
]

const tshirt = [
  document.querySelector("#tshirtColorNone"),
  document.querySelector("#tshirtColor"),
]
const trousers = [
  document.querySelector("#trousersNone"),
  document.querySelector("#trouser"),
]

for (let i = 0; i < trousers.length; i++) {
  trousers[i].addEventListener("change", () => {
      let tHair = ""
      typeHair.forEach(el => {
        if(el.checked) {
          if(el.getAttribute("id") == "hairTypeBang") {
            tHair = "bang"
          } else if (el.getAttribute("id") == "hairTypeCombing") {
            tHair = "сombing"
          } else if (el.getAttribute("id") == "hairTypeLong") {
            tHair = "long"
          } else if (el.getAttribute("id") == "hairTypeShort") {
            tHair = "short"
          } else if (el.getAttribute("id") == "hairTypeBald") {
            tHair = "bald"
          }
        }
      })
      let cHair = ""
      colorHair.forEach(el => {
        if(el.checked) {
          if(el.getAttribute("id") == "hairColorBlack") {
            cHair = "black"
          }
          if(el.getAttribute("id") == "hairColorGray") {
            cHair = "gray"
          }
          if(el.getAttribute("id") == "hairColorBrown") {
            cHair = "brown"
          }
          if(el.getAttribute("id") == "hairColorYellow") {
            cHair = "yellow"
          }
        }
      })

      // if(trousers[i].getAttribute("id") == "trouser") {
      //   customizationPlayer.style.backgroundImage = `url(./player/trouser/${tHair}/${cHair}.webp)`
      //   characterSpritesheet.style.backgroundImage = `url(./player/trouser/${tHair}/${cHair}.webp)`
      // } else {
      //   customizationPlayer.style.backgroundImage = `url(./player/hair/${tHair}/${cHair}.webp)`
      //   characterSpritesheet.style.backgroundImage = `url(./player/hair/${tHair}/${cHair}.webp)`
      // }
      if(trousers[1].getAttribute("id") == "trouser" && trousers[1].checked && tshirt[1].getAttribute("id") == "tshirtColor" && tshirt[1].checked) {
        customizationPlayer.style.backgroundImage = `url(./player/all/${tHair}/${cHair}.webp)`
        characterSpritesheet.style.backgroundImage = `url(./player/all/${tHair}/${cHair}.webp)`
      } else if (trousers[1].getAttribute("id") == "trouser" && trousers[1].checked) {
        customizationPlayer.style.backgroundImage = `url(./player/trouser/${tHair}/${cHair}.webp)`
        characterSpritesheet.style.backgroundImage = `url(./player/trouser/${tHair}/${cHair}.webp)`
      } else if (tshirt[1].getAttribute("id") == "tshirtColor" && tshirt[1].checked) {
        customizationPlayer.style.backgroundImage = `url(./player/tshirt/${tHair}/${cHair}.webp)`
        characterSpritesheet.style.backgroundImage = `url(./player/tshirt/${tHair}/${cHair}.webp)`
      } else {
        customizationPlayer.style.backgroundImage = `url(./player/hair/${tHair}/${cHair}.webp)`
        characterSpritesheet.style.backgroundImage = `url(./player/hair/${tHair}/${cHair}.webp)`
      }
  })  
}

for(let i = 0; i < colorHair.length; i++) {
  colorHair[i].addEventListener("change", () => {
      changeModel(colorHair[i].getAttribute("id"))
      tshirt[0].checked = "checked"
      trousers[0].checked = "checked"
  })
}
for(let i = 0; i < typeHair.length; i++) {
  typeHair[i].addEventListener("change", () => {
    changeModel("hairColorBrown")
    colorHair[2].checked = "checked"
    tshirt[0].checked = "checked"
    trousers[0].checked = "checked"
  })
}

for(let i = 0; i < tshirt.length; i++) {
  tshirt[i].addEventListener("change", () => {
    let tHair = ""
    typeHair.forEach(el => {
      if(el.checked) {
        if(el.getAttribute("id") == "hairTypeBang") {
          tHair = "bang"
        } else if (el.getAttribute("id") == "hairTypeCombing") {
          tHair = "сombing"
        } else if (el.getAttribute("id") == "hairTypeLong") {
          tHair = "long"
        } else if (el.getAttribute("id") == "hairTypeShort") {
          tHair = "short"
        } else if (el.getAttribute("id") == "hairTypeBald") {
          tHair = "bald"
        }
      }
    })
    let cHair = ""
    colorHair.forEach(el => {
      if(el.checked) {
        if(el.getAttribute("id") == "hairColorBlack") {
          cHair = "black"
        }
        if(el.getAttribute("id") == "hairColorGray") {
          cHair = "gray"
        }
        if(el.getAttribute("id") == "hairColorBrown") {
          cHair = "brown"
        }
        if(el.getAttribute("id") == "hairColorYellow") {
          cHair = "yellow"
        }
      }
    })

    // if(tshirt[i].getAttribute("id") == "tshirtColor") {
    //   customizationPlayer.style.backgroundImage = `url(./player/tshirt/${tHair}/${cHair}.webp)`
    //   characterSpritesheet.style.backgroundImage = `url(./player/tshirt/${tHair}/${cHair}.webp)`
    // } else {
    //   customizationPlayer.style.backgroundImage = `url(./player/hair/${tHair}/${cHair}.webp)`
    //   characterSpritesheet.style.backgroundImage = `url(./player/hair/${tHair}/${cHair}.webp)`
    // }
      if(trousers[1].getAttribute("id") == "trouser" && trousers[1].checked && tshirt[1].getAttribute("id") == "tshirtColor" && tshirt[1].checked) {
        customizationPlayer.style.backgroundImage = `url(./player/all/${tHair}/${cHair}.webp)`
        characterSpritesheet.style.backgroundImage = `url(./player/all/${tHair}/${cHair}.webp)`
      } else if (trousers[1].getAttribute("id") == "trouser" && trousers[1].checked) {
        customizationPlayer.style.backgroundImage = `url(./player/trouser/${tHair}/${cHair}.webp)`
        characterSpritesheet.style.backgroundImage = `url(./player/trouser/${tHair}/${cHair}.webp)`
      } else if (tshirt[1].getAttribute("id") == "tshirtColor" && tshirt[1].checked) {
        customizationPlayer.style.backgroundImage = `url(./player/tshirt/${tHair}/${cHair}.webp)`
        characterSpritesheet.style.backgroundImage = `url(./player/tshirt/${tHair}/${cHair}.webp)`
      } else {
        customizationPlayer.style.backgroundImage = `url(./player/hair/${tHair}/${cHair}.webp)`
        characterSpritesheet.style.backgroundImage = `url(./player/hair/${tHair}/${cHair}.webp)`
      }
  })
}

// //Bind a ton of events for the dpad
// document.querySelector(".dpad-left").addEventListener("touchstart", (e) => handleDpadPress(directions.left, true));
// document.querySelector(".dpad-up").addEventListener("touchstart", (e) => handleDpadPress(directions.up, true));
// document.querySelector(".dpad-right").addEventListener("touchstart", (e) => handleDpadPress(directions.right, true));
// document.querySelector(".dpad-down").addEventListener("touchstart", (e) => handleDpadPress(directions.down, true));

// document.querySelector(".dpad-left").addEventListener("mousedown", (e) => handleDpadPress(directions.left, true));
// document.querySelector(".dpad-up").addEventListener("mousedown", (e) => handleDpadPress(directions.up, true));
// document.querySelector(".dpad-right").addEventListener("mousedown", (e) => handleDpadPress(directions.right, true));
// document.querySelector(".dpad-down").addEventListener("mousedown", (e) => handleDpadPress(directions.down, true));

// document.querySelector(".dpad-left").addEventListener("mouseover", (e) => handleDpadPress(directions.left));
// document.querySelector(".dpad-up").addEventListener("mouseover", (e) => handleDpadPress(directions.up));
// document.querySelector(".dpad-right").addEventListener("mouseover", (e) => handleDpadPress(directions.right));
// document.querySelector(".dpad-down").addEventListener("mouseover", (e) => handleDpadPress(directions.down));